waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_epsc.h
  * @author  FMSH Application Team
  * @brief   Head file of EPSC FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_EPSC_H
#define __FM33FK5XX_FL_EPSC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup EPSC_FL_ES_INIT EPSC Exported Init structures
  * @{
  */
/**
  * @brief  EPSC_NORSRAM Timing parameters structure definition
  */
typedef struct
{
    uint32_t AddressSetupTime;                /** 地址建立时间配置 */

    uint32_t AddressHoldTime;                 /** 地址保持时间配置 */

    uint32_t DataSetupTime;                   /** 数据时间配置 */

    uint32_t BusTurnAroundDuration;           /** 总线转向空闲时间配置 */

    uint32_t CLKDivision;                     /** 时钟分频配置*/

    uint32_t DataLatency;                     /** 数据延时配置*/

    uint32_t AccessMode;                      /** 扩展模式选择 */

} EPSC_NORSRAM_RWTimingTypeDef;

typedef struct
{
    uint32_t AddressSetupTime;                /** 地址建立时间配置 */

    uint32_t AddressHoldTime;                 /** 地址保持时间配置 */

    uint32_t DataSetupTime;                   /** 数据时间配置 */

    uint32_t BusTurnAroundDuration;           /** 总线转向空闲时间配置 */

    uint32_t AccessMode;                      /** 扩展模式选择 */

} EPSC_NORSRAM_WTimingTypeDef;
/**
  * @brief  EPSC_NORSRAM Configuration Structure definition
  */
typedef struct
{

    uint32_t NSBank;                                              /** Bank1选择 */

    FL_FunState DataAddressMux;                       /** 地址数据复用配置 */

    uint32_t MemoryType;                                      /** 存储类型配置 */

    uint32_t MemoryDataWidth;                             /** 存储数据位宽 */

    FL_FunState BurstAccessMode;            /** 突发模式配置 */

    uint32_t WriteBurst;                      /** 突发模式写配置 */

    FL_FunState WaitSignal;                 /** wait信号使能配置 */

    FL_FunState AsynchronousWait;           /** 异步wait模式配置*/

    uint32_t WaitSignalPolarity;              /** wait信号极性配置 */

    uint32_t WaitSignalActive;                /** wait信号时序有效配置 */

    FL_FunState WriteOperation;             /** 写使能配置 */

    FL_FunState ExtendedMode;               /** 扩展模式配置 */

    EPSC_NORSRAM_RWTimingTypeDef *ReadWriteTimingStruct;

    EPSC_NORSRAM_WTimingTypeDef *WriteTimingStruct;

} EPSC_NORSRAM_InitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup EPSC_FL_Exported_Constants EPSC Exported Constants
  * @{
  */

#define    EPSC_NCR1_FIFOEN_Pos                                   (27U)
#define    EPSC_NCR1_FIFOEN_Msk                                   (0x1U << EPSC_NCR1_FIFOEN_Pos)
#define    EPSC_NCR1_FIFOEN                                       EPSC_NCR1_FIFOEN_Msk

#define    EPSC_NCR1_TCEN_Pos                                     (24U)
#define    EPSC_NCR1_TCEN_Msk                                     (0x1U << EPSC_NCR1_TCEN_Pos)
#define    EPSC_NCR1_TCEN                                         EPSC_NCR1_TCEN_Msk

#define    EPSC_NCR1_CCLKEN_Pos                                   (20U)
#define    EPSC_NCR1_CCLKEN_Msk                                   (0x1U << EPSC_NCR1_CCLKEN_Pos)
#define    EPSC_NCR1_CCLKEN                                       EPSC_NCR1_CCLKEN_Msk

#define    EPSC_NCR1_CBURSTWR_Pos                                 (19U)
#define    EPSC_NCR1_CBURSTWR_Msk                                 (0x1U << EPSC_NCR1_CBURSTWR_Pos)
#define    EPSC_NCR1_CBURSTWR                                     EPSC_NCR1_CBURSTWR_Msk

#define    EPSC_NCR1_ASYNCWAIT_Pos                                (15U)
#define    EPSC_NCR1_ASYNCWAIT_Msk                                (0x1U << EPSC_NCR1_ASYNCWAIT_Pos)
#define    EPSC_NCR1_ASYNCWAIT                                    EPSC_NCR1_ASYNCWAIT_Msk

#define    EPSC_NCR1_EXTMOD_Pos                                   (14U)
#define    EPSC_NCR1_EXTMOD_Msk                                   (0x1U << EPSC_NCR1_EXTMOD_Pos)
#define    EPSC_NCR1_EXTMOD                                       EPSC_NCR1_EXTMOD_Msk

#define    EPSC_NCR1_WAITEN_Pos                                   (13U)
#define    EPSC_NCR1_WAITEN_Msk                                   (0x1U << EPSC_NCR1_WAITEN_Pos)
#define    EPSC_NCR1_WAITEN                                       EPSC_NCR1_WAITEN_Msk

#define    EPSC_NCR1_WREN_Pos                                     (12U)
#define    EPSC_NCR1_WREN_Msk                                     (0x1U << EPSC_NCR1_WREN_Pos)
#define    EPSC_NCR1_WREN                                         EPSC_NCR1_WREN_Msk

#define    EPSC_NCR1_WAITCFG_Pos                                  (11U)
#define    EPSC_NCR1_WAITCFG_Msk                                  (0x1U << EPSC_NCR1_WAITCFG_Pos)
#define    EPSC_NCR1_WAITCFG                                      EPSC_NCR1_WAITCFG_Msk

#define    EPSC_NCR1_WAITPOL_Pos                                  (9U)
#define    EPSC_NCR1_WAITPOL_Msk                                  (0x1U << EPSC_NCR1_WAITPOL_Pos)
#define    EPSC_NCR1_WAITPOL                                      EPSC_NCR1_WAITPOL_Msk

#define    EPSC_NCR1_BURSTEN_Pos                                  (8U)
#define    EPSC_NCR1_BURSTEN_Msk                                  (0x1U << EPSC_NCR1_BURSTEN_Pos)
#define    EPSC_NCR1_BURSTEN                                      EPSC_NCR1_BURSTEN_Msk

#define    EPSC_NCR1_MWID_Pos                                     (4U)
#define    EPSC_NCR1_MWID_Msk                                     (0x3U << EPSC_NCR1_MWID_Pos)
#define    EPSC_NCR1_MWID                                         EPSC_NCR1_MWID_Msk

#define    EPSC_NCR1_MTYP_Pos                                     (2U)
#define    EPSC_NCR1_MTYP_Msk                                     (0x3U << EPSC_NCR1_MTYP_Pos)
#define    EPSC_NCR1_MTYP                                         EPSC_NCR1_MTYP_Msk

#define    EPSC_NCR1_MUXEN_Pos                                    (1U)
#define    EPSC_NCR1_MUXEN_Msk                                    (0x1U << EPSC_NCR1_MUXEN_Pos)
#define    EPSC_NCR1_MUXEN                                        EPSC_NCR1_MUXEN_Msk

