waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
#define    EPSC_NCR1_MBKEN_Pos                                    (0U)
#define    EPSC_NCR1_MBKEN_Msk                                    (0x1U << EPSC_NCR1_MBKEN_Pos)
#define    EPSC_NCR1_MBKEN                                        EPSC_NCR1_MBKEN_Msk

#define    EPSC_NTR1_ACCMOD_Pos                                   (28U)
#define    EPSC_NTR1_ACCMOD_Msk                                   (0x3U << EPSC_NTR1_ACCMOD_Pos)
#define    EPSC_NTR1_ACCMOD                                       EPSC_NTR1_ACCMOD_Msk

#define    EPSC_NTR1_DATLAT_Pos                                   (24U)
#define    EPSC_NTR1_DATLAT_Msk                                   (0xfU << EPSC_NTR1_DATLAT_Pos)
#define    EPSC_NTR1_DATLAT                                       EPSC_NTR1_DATLAT_Msk

#define    EPSC_NTR1_CLKDIV_Pos                                   (20U)
#define    EPSC_NTR1_CLKDIV_Msk                                   (0xfU << EPSC_NTR1_CLKDIV_Pos)
#define    EPSC_NTR1_CLKDIV                                       EPSC_NTR1_CLKDIV_Msk

#define    EPSC_NTR1_BUSTURN_Pos                                  (16U)
#define    EPSC_NTR1_BUSTURN_Msk                                  (0xfU << EPSC_NTR1_BUSTURN_Pos)
#define    EPSC_NTR1_BUSTURN                                      EPSC_NTR1_BUSTURN_Msk

#define    EPSC_NTR1_DATAST_Pos                                   (8U)
#define    EPSC_NTR1_DATAST_Msk                                   (0xffU << EPSC_NTR1_DATAST_Pos)
#define    EPSC_NTR1_DATAST                                       EPSC_NTR1_DATAST_Msk

#define    EPSC_NTR1_ADDHLD_Pos                                   (4U)
#define    EPSC_NTR1_ADDHLD_Msk                                   (0xfU << EPSC_NTR1_ADDHLD_Pos)
#define    EPSC_NTR1_ADDHLD                                       EPSC_NTR1_ADDHLD_Msk

#define    EPSC_NTR1_ADDSET_Pos                                   (0U)
#define    EPSC_NTR1_ADDSET_Msk                                   (0xfU << EPSC_NTR1_ADDSET_Pos)
#define    EPSC_NTR1_ADDSET                                       EPSC_NTR1_ADDSET_Msk

#define    EPSC_NWTR1_ACCMOD_Pos                                  (28U)
#define    EPSC_NWTR1_ACCMOD_Msk                                  (0x3U << EPSC_NWTR1_ACCMOD_Pos)
#define    EPSC_NWTR1_ACCMOD                                      EPSC_NWTR1_ACCMOD_Msk

#define    EPSC_NWTR1_BUSTURN_Pos                                 (16U)
#define    EPSC_NWTR1_BUSTURN_Msk                                 (0xfU << EPSC_NWTR1_BUSTURN_Pos)
#define    EPSC_NWTR1_BUSTURN                                     EPSC_NWTR1_BUSTURN_Msk

#define    EPSC_NWTR1_DATAST_Pos                                  (8U)
#define    EPSC_NWTR1_DATAST_Msk                                  (0xffU << EPSC_NWTR1_DATAST_Pos)
#define    EPSC_NWTR1_DATAST                                      EPSC_NWTR1_DATAST_Msk

#define    EPSC_NWTR1_ADDHLD_Pos                                  (4U)
#define    EPSC_NWTR1_ADDHLD_Msk                                  (0xfU << EPSC_NWTR1_ADDHLD_Pos)
#define    EPSC_NWTR1_ADDHLD                                      EPSC_NWTR1_ADDHLD_Msk

#define    EPSC_NWTR1_ADDSET_Pos                                  (0U)
#define    EPSC_NWTR1_ADDSET_Msk                                  (0xfU << EPSC_NWTR1_ADDSET_Pos)
#define    EPSC_NWTR1_ADDSET                                      EPSC_NWTR1_ADDSET_Msk

#define    EPSC_NCR2_FIFOEN_Pos                                   (27U)
#define    EPSC_NCR2_FIFOEN_Msk                                   (0x1U << EPSC_NCR2_FIFOEN_Pos)
#define    EPSC_NCR2_FIFOEN                                       EPSC_NCR2_FIFOEN_Msk

#define    EPSC_NCR2_TCEN_Pos                                     (24U)
#define    EPSC_NCR2_TCEN_Msk                                     (0x1U << EPSC_NCR2_TCEN_Pos)
#define    EPSC_NCR2_TCEN                                         EPSC_NCR2_TCEN_Msk

#define    EPSC_NCR2_CCLKEN_Pos                                   (20U)
#define    EPSC_NCR2_CCLKEN_Msk                                   (0x1U << EPSC_NCR2_CCLKEN_Pos)
#define    EPSC_NCR2_CCLKEN                                       EPSC_NCR2_CCLKEN_Msk

#define    EPSC_NCR2_CBURSTWR_Pos                                 (19U)
#define    EPSC_NCR2_CBURSTWR_Msk                                 (0x1U << EPSC_NCR2_CBURSTWR_Pos)
#define    EPSC_NCR2_CBURSTWR                                     EPSC_NCR2_CBURSTWR_Msk

#define    EPSC_NCR2_ASYNCWAIT_Pos                                (15U)
#define    EPSC_NCR2_ASYNCWAIT_Msk                                (0x1U << EPSC_NCR2_ASYNCWAIT_Pos)
#define    EPSC_NCR2_ASYNCWAIT                                    EPSC_NCR2_ASYNCWAIT_Msk

#define    EPSC_NCR2_EXTMOD_Pos                                   (14U)
#define    EPSC_NCR2_EXTMOD_Msk                                   (0x1U << EPSC_NCR2_EXTMOD_Pos)
#define    EPSC_NCR2_EXTMOD                                       EPSC_NCR2_EXTMOD_Msk

#define    EPSC_NCR2_WAITEN_Pos                                   (13U)
#define    EPSC_NCR2_WAITEN_Msk                                   (0x1U << EPSC_NCR2_WAITEN_Pos)
#define    EPSC_NCR2_WAITEN                                       EPSC_NCR2_WAITEN_Msk

#define    EPSC_NCR2_WREN_Pos                                     (12U)
#define    EPSC_NCR2_WREN_Msk                                     (0x1U << EPSC_NCR2_WREN_Pos)
#define    EPSC_NCR2_WREN                                         EPSC_NCR2_WREN_Msk

#define    EPSC_NCR2_WAITCFG_Pos                                  (11U)
#define    EPSC_NCR2_WAITCFG_Msk                                  (0x1U << EPSC_NCR2_WAITCFG_Pos)
#define    EPSC_NCR2_WAITCFG                                      EPSC_NCR2_WAITCFG_Msk

#define    EPSC_NCR2_WAITPOL_Pos                                  (9U)
#define    EPSC_NCR2_WAITPOL_Msk                                  (0x1U << EPSC_NCR2_WAITPOL_Pos)
#define    EPSC_NCR2_WAITPOL                                      EPSC_NCR2_WAITPOL_Msk

#define    EPSC_NCR2_BURSTEN_Pos                                  (8U)
#define    EPSC_NCR2_BURSTEN_Msk                                  (0x1U << EPSC_NCR2_BURSTEN_Pos)
#define    EPSC_NCR2_BURSTEN                                      EPSC_NCR2_BURSTEN_Msk

#define    EPSC_NCR2_MWID_Pos                                     (4U)
#define    EPSC_NCR2_MWID_Msk                                     (0x3U << EPSC_NCR2_MWID_Pos)
#define    EPSC_NCR2_MWID                                         EPSC_NCR2_MWID_Msk

#define    EPSC_NCR2_MTYP_Pos                                     (2U)
#define    EPSC_NCR2_MTYP_Msk                                     (0x3U << EPSC_NCR2_MTYP_Pos)
#define    EPSC_NCR2_MTYP                                         EPSC_NCR2_MTYP_Msk

#define    EPSC_NCR2_MUXEN_Pos                                    (1U)
#define    EPSC_NCR2_MUXEN_Msk                                    (0x1U << EPSC_NCR2_MUXEN_Pos)
#define    EPSC_NCR2_MUXEN                                        EPSC_NCR2_MUXEN_Msk

