waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
#define    EPSC_NCR2_MBKEN_Pos                                    (0U)
#define    EPSC_NCR2_MBKEN_Msk                                    (0x1U << EPSC_NCR2_MBKEN_Pos)
#define    EPSC_NCR2_MBKEN                                        EPSC_NCR2_MBKEN_Msk

#define    EPSC_NTR2_ACCMOD_Pos                                   (28U)
#define    EPSC_NTR2_ACCMOD_Msk                                   (0x3U << EPSC_NTR2_ACCMOD_Pos)
#define    EPSC_NTR2_ACCMOD                                       EPSC_NTR2_ACCMOD_Msk

#define    EPSC_NTR2_DATLAT_Pos                                   (24U)
#define    EPSC_NTR2_DATLAT_Msk                                   (0xfU << EPSC_NTR2_DATLAT_Pos)
#define    EPSC_NTR2_DATLAT                                       EPSC_NTR2_DATLAT_Msk

#define    EPSC_NTR2_CLKDIV_Pos                                   (20U)
#define    EPSC_NTR2_CLKDIV_Msk                                   (0xfU << EPSC_NTR2_CLKDIV_Pos)
#define    EPSC_NTR2_CLKDIV                                       EPSC_NTR2_CLKDIV_Msk

#define    EPSC_NTR2_BUSTURN_Pos                                  (16U)
#define    EPSC_NTR2_BUSTURN_Msk                                  (0xfU << EPSC_NTR2_BUSTURN_Pos)
#define    EPSC_NTR2_BUSTURN                                      EPSC_NTR2_BUSTURN_Msk

#define    EPSC_NTR2_DATAST_Pos                                   (8U)
#define    EPSC_NTR2_DATAST_Msk                                   (0xffU << EPSC_NTR2_DATAST_Pos)
#define    EPSC_NTR2_DATAST                                       EPSC_NTR2_DATAST_Msk

#define    EPSC_NTR2_ADDHLD_Pos                                   (4U)
#define    EPSC_NTR2_ADDHLD_Msk                                   (0xfU << EPSC_NTR2_ADDHLD_Pos)
#define    EPSC_NTR2_ADDHLD                                       EPSC_NTR2_ADDHLD_Msk

#define    EPSC_NTR2_ADDSET_Pos                                   (0U)
#define    EPSC_NTR2_ADDSET_Msk                                   (0xfU << EPSC_NTR2_ADDSET_Pos)
#define    EPSC_NTR2_ADDSET                                       EPSC_NTR2_ADDSET_Msk

#define    EPSC_NWTR2_ACCMOD_Pos                                  (28U)
#define    EPSC_NWTR2_ACCMOD_Msk                                  (0x3U << EPSC_NWTR2_ACCMOD_Pos)
#define    EPSC_NWTR2_ACCMOD                                      EPSC_NWTR2_ACCMOD_Msk

#define    EPSC_NWTR2_BUSTURN_Pos                                 (16U)
#define    EPSC_NWTR2_BUSTURN_Msk                                 (0xfU << EPSC_NWTR2_BUSTURN_Pos)
#define    EPSC_NWTR2_BUSTURN                                     EPSC_NWTR2_BUSTURN_Msk

#define    EPSC_NWTR2_DATAST_Pos                                  (8U)
#define    EPSC_NWTR2_DATAST_Msk                                  (0xffU << EPSC_NWTR2_DATAST_Pos)
#define    EPSC_NWTR2_DATAST                                      EPSC_NWTR2_DATAST_Msk

#define    EPSC_NWTR2_ADDHLD_Pos                                  (4U)
#define    EPSC_NWTR2_ADDHLD_Msk                                  (0xfU << EPSC_NWTR2_ADDHLD_Pos)
#define    EPSC_NWTR2_ADDHLD                                      EPSC_NWTR2_ADDHLD_Msk

#define    EPSC_NWTR2_ADDSET_Pos                                  (0U)
#define    EPSC_NWTR2_ADDSET_Msk                                  (0xfU << EPSC_NWTR2_ADDSET_Pos)
#define    EPSC_NWTR2_ADDSET                                      EPSC_NWTR2_ADDSET_Msk

#define    EPSC_NCR3_FIFOEN_Pos                                   (27U)
#define    EPSC_NCR3_FIFOEN_Msk                                   (0x1U << EPSC_NCR3_FIFOEN_Pos)
#define    EPSC_NCR3_FIFOEN                                       EPSC_NCR3_FIFOEN_Msk

#define    EPSC_NCR3_TCEN_Pos                                     (24U)
#define    EPSC_NCR3_TCEN_Msk                                     (0x1U << EPSC_NCR3_TCEN_Pos)
#define    EPSC_NCR3_TCEN                                         EPSC_NCR3_TCEN_Msk

#define    EPSC_NCR3_CCLKEN_Pos                                   (20U)
#define    EPSC_NCR3_CCLKEN_Msk                                   (0x1U << EPSC_NCR3_CCLKEN_Pos)
#define    EPSC_NCR3_CCLKEN                                       EPSC_NCR3_CCLKEN_Msk

#define    EPSC_NCR3_CBURSTWR_Pos                                 (19U)
#define    EPSC_NCR3_CBURSTWR_Msk                                 (0x1U << EPSC_NCR3_CBURSTWR_Pos)
#define    EPSC_NCR3_CBURSTWR                                     EPSC_NCR3_CBURSTWR_Msk

#define    EPSC_NCR3_ASYNCWAIT_Pos                                (15U)
#define    EPSC_NCR3_ASYNCWAIT_Msk                                (0x1U << EPSC_NCR3_ASYNCWAIT_Pos)
#define    EPSC_NCR3_ASYNCWAIT                                    EPSC_NCR3_ASYNCWAIT_Msk

#define    EPSC_NCR3_EXTMOD_Pos                                   (14U)
#define    EPSC_NCR3_EXTMOD_Msk                                   (0x1U << EPSC_NCR3_EXTMOD_Pos)
#define    EPSC_NCR3_EXTMOD                                       EPSC_NCR3_EXTMOD_Msk

#define    EPSC_NCR3_WAITEN_Pos                                   (13U)
#define    EPSC_NCR3_WAITEN_Msk                                   (0x1U << EPSC_NCR3_WAITEN_Pos)
#define    EPSC_NCR3_WAITEN                                       EPSC_NCR3_WAITEN_Msk

#define    EPSC_NCR3_WREN_Pos                                     (12U)
#define    EPSC_NCR3_WREN_Msk                                     (0x1U << EPSC_NCR3_WREN_Pos)
#define    EPSC_NCR3_WREN                                         EPSC_NCR3_WREN_Msk

#define    EPSC_NCR3_WAITCFG_Pos                                  (11U)
#define    EPSC_NCR3_WAITCFG_Msk                                  (0x1U << EPSC_NCR3_WAITCFG_Pos)
#define    EPSC_NCR3_WAITCFG                                      EPSC_NCR3_WAITCFG_Msk

#define    EPSC_NCR3_WAITPOL_Pos                                  (9U)
#define    EPSC_NCR3_WAITPOL_Msk                                  (0x1U << EPSC_NCR3_WAITPOL_Pos)
#define    EPSC_NCR3_WAITPOL                                      EPSC_NCR3_WAITPOL_Msk

#define    EPSC_NCR3_BURSTEN_Pos                                  (8U)
#define    EPSC_NCR3_BURSTEN_Msk                                  (0x1U << EPSC_NCR3_BURSTEN_Pos)
#define    EPSC_NCR3_BURSTEN                                      EPSC_NCR3_BURSTEN_Msk

