waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
#define    EPSC_NCR3_MWID_Pos                                     (4U)
#define    EPSC_NCR3_MWID_Msk                                     (0x3U << EPSC_NCR3_MWID_Pos)
#define    EPSC_NCR3_MWID                                         EPSC_NCR3_MWID_Msk

#define    EPSC_NCR3_MTYP_Pos                                     (2U)
#define    EPSC_NCR3_MTYP_Msk                                     (0x3U << EPSC_NCR3_MTYP_Pos)
#define    EPSC_NCR3_MTYP                                         EPSC_NCR3_MTYP_Msk

#define    EPSC_NCR3_MUXEN_Pos                                    (1U)
#define    EPSC_NCR3_MUXEN_Msk                                    (0x1U << EPSC_NCR3_MUXEN_Pos)
#define    EPSC_NCR3_MUXEN                                        EPSC_NCR3_MUXEN_Msk

#define    EPSC_NCR3_MBKEN_Pos                                    (0U)
#define    EPSC_NCR3_MBKEN_Msk                                    (0x1U << EPSC_NCR3_MBKEN_Pos)
#define    EPSC_NCR3_MBKEN                                        EPSC_NCR3_MBKEN_Msk

#define    EPSC_NTR3_ACCMOD_Pos                                   (28U)
#define    EPSC_NTR3_ACCMOD_Msk                                   (0x3U << EPSC_NTR3_ACCMOD_Pos)
#define    EPSC_NTR3_ACCMOD                                       EPSC_NTR3_ACCMOD_Msk

#define    EPSC_NTR3_DATLAT_Pos                                   (24U)
#define    EPSC_NTR3_DATLAT_Msk                                   (0xfU << EPSC_NTR3_DATLAT_Pos)
#define    EPSC_NTR3_DATLAT                                       EPSC_NTR3_DATLAT_Msk

#define    EPSC_NTR3_CLKDIV_Pos                                   (20U)
#define    EPSC_NTR3_CLKDIV_Msk                                   (0xfU << EPSC_NTR3_CLKDIV_Pos)
#define    EPSC_NTR3_CLKDIV                                       EPSC_NTR3_CLKDIV_Msk

#define    EPSC_NTR3_BUSTURN_Pos                                  (16U)
#define    EPSC_NTR3_BUSTURN_Msk                                  (0xfU << EPSC_NTR3_BUSTURN_Pos)
#define    EPSC_NTR3_BUSTURN                                      EPSC_NTR3_BUSTURN_Msk

#define    EPSC_NTR3_DATAST_Pos                                   (8U)
#define    EPSC_NTR3_DATAST_Msk                                   (0xffU << EPSC_NTR3_DATAST_Pos)
#define    EPSC_NTR3_DATAST                                       EPSC_NTR3_DATAST_Msk

#define    EPSC_NTR3_ADDHLD_Pos                                   (4U)
#define    EPSC_NTR3_ADDHLD_Msk                                   (0xfU << EPSC_NTR3_ADDHLD_Pos)
#define    EPSC_NTR3_ADDHLD                                       EPSC_NTR3_ADDHLD_Msk

#define    EPSC_NTR3_ADDSET_Pos                                   (0U)
#define    EPSC_NTR3_ADDSET_Msk                                   (0xfU << EPSC_NTR3_ADDSET_Pos)
#define    EPSC_NTR3_ADDSET                                       EPSC_NTR3_ADDSET_Msk

#define    EPSC_NWTR3_ACCMOD_Pos                                  (28U)
#define    EPSC_NWTR3_ACCMOD_Msk                                  (0x3U << EPSC_NWTR3_ACCMOD_Pos)
#define    EPSC_NWTR3_ACCMOD                                      EPSC_NWTR3_ACCMOD_Msk

#define    EPSC_NWTR3_BUSTURN_Pos                                 (16U)
#define    EPSC_NWTR3_BUSTURN_Msk                                 (0xfU << EPSC_NWTR3_BUSTURN_Pos)
#define    EPSC_NWTR3_BUSTURN                                     EPSC_NWTR3_BUSTURN_Msk

#define    EPSC_NWTR3_DATAST_Pos                                  (8U)
#define    EPSC_NWTR3_DATAST_Msk                                  (0xffU << EPSC_NWTR3_DATAST_Pos)
#define    EPSC_NWTR3_DATAST                                      EPSC_NWTR3_DATAST_Msk

#define    EPSC_NWTR3_ADDHLD_Pos                                  (4U)
#define    EPSC_NWTR3_ADDHLD_Msk                                  (0xfU << EPSC_NWTR3_ADDHLD_Pos)
#define    EPSC_NWTR3_ADDHLD                                      EPSC_NWTR3_ADDHLD_Msk

#define    EPSC_NWTR3_ADDSET_Pos                                  (0U)
#define    EPSC_NWTR3_ADDSET_Msk                                  (0xfU << EPSC_NWTR3_ADDSET_Pos)
#define    EPSC_NWTR3_ADDSET                                      EPSC_NWTR3_ADDSET_Msk

#define    EPSC_NCR4_FIFOEN_Pos                                   (27U)
#define    EPSC_NCR4_FIFOEN_Msk                                   (0x1U << EPSC_NCR4_FIFOEN_Pos)
#define    EPSC_NCR4_FIFOEN                                       EPSC_NCR4_FIFOEN_Msk

#define    EPSC_NCR4_TCEN_Pos                                     (24U)
#define    EPSC_NCR4_TCEN_Msk                                     (0x1U << EPSC_NCR4_TCEN_Pos)
#define    EPSC_NCR4_TCEN                                         EPSC_NCR4_TCEN_Msk

#define    EPSC_NCR4_CCLKEN_Pos                                   (20U)
#define    EPSC_NCR4_CCLKEN_Msk                                   (0x1U << EPSC_NCR4_CCLKEN_Pos)
#define    EPSC_NCR4_CCLKEN                                       EPSC_NCR4_CCLKEN_Msk

#define    EPSC_NCR4_CBURSTWR_Pos                                 (19U)
#define    EPSC_NCR4_CBURSTWR_Msk                                 (0x1U << EPSC_NCR4_CBURSTWR_Pos)
#define    EPSC_NCR4_CBURSTWR                                     EPSC_NCR4_CBURSTWR_Msk

#define    EPSC_NCR4_ASYNCWAIT_Pos                                (15U)
#define    EPSC_NCR4_ASYNCWAIT_Msk                                (0x1U << EPSC_NCR4_ASYNCWAIT_Pos)
#define    EPSC_NCR4_ASYNCWAIT                                    EPSC_NCR4_ASYNCWAIT_Msk

#define    EPSC_NCR4_EXTMOD_Pos                                   (14U)
#define    EPSC_NCR4_EXTMOD_Msk                                   (0x1U << EPSC_NCR4_EXTMOD_Pos)
#define    EPSC_NCR4_EXTMOD                                       EPSC_NCR4_EXTMOD_Msk

#define    EPSC_NCR4_WAITEN_Pos                                   (13U)
#define    EPSC_NCR4_WAITEN_Msk                                   (0x1U << EPSC_NCR4_WAITEN_Pos)
#define    EPSC_NCR4_WAITEN                                       EPSC_NCR4_WAITEN_Msk

#define    EPSC_NCR4_WREN_Pos                                     (12U)
#define    EPSC_NCR4_WREN_Msk                                     (0x1U << EPSC_NCR4_WREN_Pos)
#define    EPSC_NCR4_WREN                                         EPSC_NCR4_WREN_Msk

#define    EPSC_NCR4_WAITCFG_Pos                                  (11U)
#define    EPSC_NCR4_WAITCFG_Msk                                  (0x1U << EPSC_NCR4_WAITCFG_Pos)
#define    EPSC_NCR4_WAITCFG                                      EPSC_NCR4_WAITCFG_Msk

