waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
#define    EPSC_NCR4_WAITPOL_Pos                                  (9U)
#define    EPSC_NCR4_WAITPOL_Msk                                  (0x1U << EPSC_NCR4_WAITPOL_Pos)
#define    EPSC_NCR4_WAITPOL                                      EPSC_NCR4_WAITPOL_Msk

#define    EPSC_NCR4_BURSTEN_Pos                                  (8U)
#define    EPSC_NCR4_BURSTEN_Msk                                  (0x1U << EPSC_NCR4_BURSTEN_Pos)
#define    EPSC_NCR4_BURSTEN                                      EPSC_NCR4_BURSTEN_Msk

#define    EPSC_NCR4_MWID_Pos                                     (4U)
#define    EPSC_NCR4_MWID_Msk                                     (0x3U << EPSC_NCR4_MWID_Pos)
#define    EPSC_NCR4_MWID                                         EPSC_NCR4_MWID_Msk

#define    EPSC_NCR4_MTYP_Pos                                     (2U)
#define    EPSC_NCR4_MTYP_Msk                                     (0x3U << EPSC_NCR4_MTYP_Pos)
#define    EPSC_NCR4_MTYP                                         EPSC_NCR4_MTYP_Msk

#define    EPSC_NCR4_MUXEN_Pos                                    (1U)
#define    EPSC_NCR4_MUXEN_Msk                                    (0x1U << EPSC_NCR4_MUXEN_Pos)
#define    EPSC_NCR4_MUXEN                                        EPSC_NCR4_MUXEN_Msk

#define    EPSC_NCR4_MBKEN_Pos                                    (0U)
#define    EPSC_NCR4_MBKEN_Msk                                    (0x1U << EPSC_NCR4_MBKEN_Pos)
#define    EPSC_NCR4_MBKEN                                        EPSC_NCR4_MBKEN_Msk

#define    EPSC_NTR4_ACCMOD_Pos                                   (28U)
#define    EPSC_NTR4_ACCMOD_Msk                                   (0x3U << EPSC_NTR4_ACCMOD_Pos)
#define    EPSC_NTR4_ACCMOD                                       EPSC_NTR4_ACCMOD_Msk

#define    EPSC_NTR4_DATLAT_Pos                                   (24U)
#define    EPSC_NTR4_DATLAT_Msk                                   (0xfU << EPSC_NTR4_DATLAT_Pos)
#define    EPSC_NTR4_DATLAT                                       EPSC_NTR4_DATLAT_Msk

#define    EPSC_NTR4_CLKDIV_Pos                                   (20U)
#define    EPSC_NTR4_CLKDIV_Msk                                   (0xfU << EPSC_NTR4_CLKDIV_Pos)
#define    EPSC_NTR4_CLKDIV                                       EPSC_NTR4_CLKDIV_Msk

#define    EPSC_NTR4_BUSTURN_Pos                                  (16U)
#define    EPSC_NTR4_BUSTURN_Msk                                  (0xfU << EPSC_NTR4_BUSTURN_Pos)
#define    EPSC_NTR4_BUSTURN                                      EPSC_NTR4_BUSTURN_Msk

#define    EPSC_NTR4_DATAST_Pos                                   (8U)
#define    EPSC_NTR4_DATAST_Msk                                   (0xffU << EPSC_NTR4_DATAST_Pos)
#define    EPSC_NTR4_DATAST                                       EPSC_NTR4_DATAST_Msk

#define    EPSC_NTR4_ADDHLD_Pos                                   (4U)
#define    EPSC_NTR4_ADDHLD_Msk                                   (0xfU << EPSC_NTR4_ADDHLD_Pos)
#define    EPSC_NTR4_ADDHLD                                       EPSC_NTR4_ADDHLD_Msk

#define    EPSC_NTR4_ADDSET_Pos                                   (0U)
#define    EPSC_NTR4_ADDSET_Msk                                   (0xfU << EPSC_NTR4_ADDSET_Pos)
#define    EPSC_NTR4_ADDSET                                       EPSC_NTR4_ADDSET_Msk

#define    EPSC_NWTR4_ACCMOD_Pos                                  (28U)
#define    EPSC_NWTR4_ACCMOD_Msk                                  (0x3U << EPSC_NWTR4_ACCMOD_Pos)
#define    EPSC_NWTR4_ACCMOD                                      EPSC_NWTR4_ACCMOD_Msk

#define    EPSC_NWTR4_BUSTURN_Pos                                 (16U)
#define    EPSC_NWTR4_BUSTURN_Msk                                 (0xfU << EPSC_NWTR4_BUSTURN_Pos)
#define    EPSC_NWTR4_BUSTURN                                     EPSC_NWTR4_BUSTURN_Msk

#define    EPSC_NWTR4_DATAST_Pos                                  (8U)
#define    EPSC_NWTR4_DATAST_Msk                                  (0xffU << EPSC_NWTR4_DATAST_Pos)
#define    EPSC_NWTR4_DATAST                                      EPSC_NWTR4_DATAST_Msk

#define    EPSC_NWTR4_ADDHLD_Pos                                  (4U)
#define    EPSC_NWTR4_ADDHLD_Msk                                  (0xfU << EPSC_NWTR4_ADDHLD_Pos)
#define    EPSC_NWTR4_ADDHLD                                      EPSC_NWTR4_ADDHLD_Msk

#define    EPSC_NWTR4_ADDSET_Pos                                  (0U)
#define    EPSC_NWTR4_ADDSET_Msk                                  (0xfU << EPSC_NWTR4_ADDSET_Pos)
#define    EPSC_NWTR4_ADDSET                                      EPSC_NWTR4_ADDSET_Msk

#define    EPSC_ISR_FULL_Pos                                      (9U)
#define    EPSC_ISR_FULL_Msk                                      (0x1U << EPSC_ISR_FULL_Pos)
#define    EPSC_ISR_FULL                                          EPSC_ISR_FULL_Msk

#define    EPSC_ISR_HALF_FULL_Pos                                 (8U)
#define    EPSC_ISR_HALF_FULL_Msk                                 (0x1U << EPSC_ISR_HALF_FULL_Pos)
#define    EPSC_ISR_HALF_FULL                                     EPSC_ISR_HALF_FULL_Msk

#define    EPSC_ISR_TCF_Pos                                       (7U)
#define    EPSC_ISR_TCF_Msk                                       (0x1U << EPSC_ISR_TCF_Pos)
#define    EPSC_ISR_TCF                                           EPSC_ISR_TCF_Msk

#define    EPSC_ISR_TEF_Pos                                       (6U)
#define    EPSC_ISR_TEF_Msk                                       (0x1U << EPSC_ISR_TEF_Pos)
#define    EPSC_ISR_TEF                                           EPSC_ISR_TEF_Msk

#define    EPSC_ISR_BUSY_Pos                                      (5U)
#define    EPSC_ISR_BUSY_Msk                                      (0x1U << EPSC_ISR_BUSY_Pos)
#define    EPSC_ISR_BUSY                                          EPSC_ISR_BUSY_Msk

#define    EPSC_ISR_TOF_Pos                                       (4U)
#define    EPSC_ISR_TOF_Msk                                       (0x1U << EPSC_ISR_TOF_Pos)
#define    EPSC_ISR_TOF                                           EPSC_ISR_TOF_Msk

#define    EPSC_ISR_NER_Pos                                       (2U)
#define    EPSC_ISR_NER_Msk                                       (0x1U << EPSC_ISR_NER_Pos)
#define    EPSC_ISR_NER                                           EPSC_ISR_NER_Msk

#define    EPSC_ISR_NEF_Pos                                       (1U)
#define    EPSC_ISR_NEF_Msk                                       (0x1U << EPSC_ISR_NEF_Pos)
#define    EPSC_ISR_NEF                                           EPSC_ISR_NEF_Msk

#define    EPSC_ISR_FEMPT_Pos                                     (0U)
#define    EPSC_ISR_FEMPT_Msk                                     (0x1U << EPSC_ISR_FEMPT_Pos)
#define    EPSC_ISR_FEMPT                                         EPSC_ISR_FEMPT_Msk

#define    EPSC_IER_FFIE_Pos                                      (9U)
#define    EPSC_IER_FFIE_Msk                                      (0x1U << EPSC_IER_FFIE_Pos)
#define    EPSC_IER_FFIE                                          EPSC_IER_FFIE_Msk

#define    EPSC_IER_FHFIE_Pos                                     (8U)
#define    EPSC_IER_FHFIE_Msk                                     (0x1U << EPSC_IER_FHFIE_Pos)
#define    EPSC_IER_FHFIE                                         EPSC_IER_FHFIE_Msk

#define    EPSC_IER_TCIE_Pos                                      (7U)
#define    EPSC_IER_TCIE_Msk                                      (0x1U << EPSC_IER_TCIE_Pos)
#define    EPSC_IER_TCIE                                          EPSC_IER_TCIE_Msk

