waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
#define    EPSC_IER_TEIE_Pos                                      (6U)
#define    EPSC_IER_TEIE_Msk                                      (0x1U << EPSC_IER_TEIE_Pos)
#define    EPSC_IER_TEIE                                          EPSC_IER_TEIE_Msk

#define    EPSC_IER_TOIE_Pos                                      (4U)
#define    EPSC_IER_TOIE_Msk                                      (0x1U << EPSC_IER_TOIE_Pos)
#define    EPSC_IER_TOIE                                          EPSC_IER_TOIE_Msk

#define    EPSC_IER_NERIE_Pos                                     (2U)
#define    EPSC_IER_NERIE_Msk                                     (0x1U << EPSC_IER_NERIE_Pos)
#define    EPSC_IER_NERIE                                         EPSC_IER_NERIE_Msk

#define    EPSC_IER_NEFIE_Pos                                     (1U)
#define    EPSC_IER_NEFIE_Msk                                     (0x1U << EPSC_IER_NEFIE_Pos)
#define    EPSC_IER_NEFIE                                         EPSC_IER_NEFIE_Msk

#define    EPSC_IER_FEIE_Pos                                      (0U)
#define    EPSC_IER_FEIE_Msk                                      (0x1U << EPSC_IER_FEIE_Pos)
#define    EPSC_IER_FEIE                                          EPSC_IER_FEIE_Msk

#define    EPSC_TOR_TO_Pos                                        (0U)
#define    EPSC_TOR_TO_Msk                                        (0xffffU << EPSC_TOR_TO_Pos)
#define    EPSC_TOR_TO                                             EPSC_TOR_TO_Msk

#define    FL_EPSC_BANK1_NORSRAM1                                 (0x1U << 0U)
#define    FL_EPSC_BANK1_NORSRAM2                                 (0x1U << 1U)
#define    FL_EPSC_BANK1_NORSRAM3                                 (0x1U << 2U)
#define    FL_EPSC_BANK1_NORSRAM4                                 (0x1U << 3U)
#define    FL_EPSC_NCR_SYNC_MODE_ASYNC                            (0x0U << 19U)
#define    FL_EPSC_NCR_SYNC_MODE_SYNC                             (0x1U << 19U)
#define    FL_EPSC_NCR_ACTIVE_STATE_BEFORE                        (0x0U << 11U)
#define    FL_EPSC_NCR_ACTIVE_STATE_DURING                        (0x1U << 11U)
#define    FL_EPSC_NCR_POLARITY_LOW                               (0x0U << 9U)
#define    FL_EPSC_NCR_POLARITY_HIGH                              (0x1U << 9U)
#define    FL_EPSC_NCR_MEMORY_WIDTH_8B                            (0x0U << 4U)
#define    FL_EPSC_NCR_MEMORY_WIDTH_16B                           (0x1U << 4U)
#define    FL_EPSC_NCR_MEMORY_TYPE_SRAM                           (0x0U << 2U)
#define    FL_EPSC_NCR_MEMORY_TYPE_PSRAM                          (0x1U << 2U)
#define    FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH                      (0x2U << 2U)
#define    FL_EPSC_NTR_EXTMOD_MODE_A                              (0x0U << 28U)
#define    FL_EPSC_NTR_EXTMOD_MODE_B                              (0x1U << 28U)
#define    FL_EPSC_NTR_EXTMOD_MODE_C                              (0x2U << 28U)
#define    FL_EPSC_NTR_EXTMOD_MODE_D                              (0x3U << 28U)
#define    FL_EPSC_NTR_DATA_LATENCY_2CLK                          (0x0U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_3CLK                          (0x1U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_4CLK                          (0x2U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_5CLK                          (0x3U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_6CLK                          (0x4U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_7CLK                          (0x5U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_8CLK                          (0x6U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_9CLK                          (0x7U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_10CLK                         (0x8U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_11CLK                         (0x9U << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_12CLK                         (0xaU << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_13CLK                         (0xbU << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_14CLK                         (0xcU << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_15CLK                         (0xdU << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_16CLK                         (0xeU << 24U)
#define    FL_EPSC_NTR_DATA_LATENCY_17CLK                         (0xfU << 24U)
#define    FL_EPSC_NTR_CLK_DIV2                                  (0x1U << 20U)
#define    FL_EPSC_NTR_CLK_DIV3                                  (0x2U << 20U)
#define    FL_EPSC_NTR_CLK_DIV4                                  (0x3U << 20U)
#define    FL_EPSC_NTR_CLK_DIV5                                  (0x4U << 20U)
#define    FL_EPSC_NTR_CLK_DIV6                                  (0x5U << 20U)
#define    FL_EPSC_NTR_CLK_DIV7                                  (0x6U << 20U)
#define    FL_EPSC_NTR_CLK_DIV8                                  (0x7U << 20U)
#define    FL_EPSC_NTR_CLK_DIV9                                  (0x8U << 20U)
#define    FL_EPSC_NTR_CLK_DIV10                                 (0x9U << 20U)
#define    FL_EPSC_NTR_CLK_DIV11                                 (0xaU << 20U)
#define    FL_EPSC_NTR_CLK_DIV12                                 (0xbU << 20U)
#define    FL_EPSC_NTR_CLK_DIV13                                 (0xcU << 20U)
#define    FL_EPSC_NTR_CLK_DIV14                                 (0xdU << 20U)
#define    FL_EPSC_NTR_CLK_DIV15                                 (0xeU << 20U)
#define    FL_EPSC_NTR_CLK_DIV16                                 (0xfU << 20U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_0CLK                        (0x0U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_1CLK                        (0x1U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_2CLK                        (0x2U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_3CLK                        (0x3U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_4CLK                        (0x4U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_5CLK                        (0x5U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_6CLK                        (0x6U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_7CLK                        (0x7U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_8CLK                        (0x8U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_9CLK                        (0x9U << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_10CLK                       (0xaU << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_11CLK                       (0xbU << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_12CLK                       (0xcU << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_13CLK                       (0xdU << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_14CLK                       (0xeU << 16U)
#define    FL_EPSC_NTR_BUS_TRUNAROUND_15CLK                       (0xfU << 16U)
#define    FL_EPSC_NWTR_EXTMOD_MODE_A                             (0x0U << 28U)
#define    FL_EPSC_NWTR_EXTMOD_MODE_B                             (0x1U << 28U)
#define    FL_EPSC_NWTR_EXTMOD_MODE_C                             (0x2U << 28U)
#define    FL_EPSC_NWTR_EXTMOD_MODE_D                             (0x3U << 28U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK                       (0x0U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK                       (0x1U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK                       (0x2U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK                       (0x3U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK                       (0x4U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK                       (0x5U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK                       (0x6U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK                       (0x7U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK                       (0x8U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK                       (0x9U << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK                      (0xaU << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK                      (0xbU << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK                      (0xcU << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK                      (0xdU << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK                      (0xeU << 16U)
#define    FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK                      (0xfU << 16U)

//#define    FL_EPSC_NCR_SYNC_MODE_ASYNC                            (0x0U << EPSC_NCR1_CBURSTWR_Pos)
//#define    FL_EPSC_NCR_SYNC_MODE_SYNC                             (0x1U << EPSC_NCR1_CBURSTWR_Pos)

//#define    FL_EPSC_NCR_ACTIVE_STATE_BEFORE                        (0x0U << EPSC_NCR1_WAITCFG_Pos)
//#define    FL_EPSC_NCR_ACTIVE_STATE_DURING                        (0x1U << EPSC_NCR1_WAITCFG_Pos)

