waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
//#define    FL_EPSC_NWTR_EXTMOD_MODE_A                             (0x0U << EPSC_NWTR2_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_B                             (0x1U << EPSC_NWTR2_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_C                             (0x2U << EPSC_NWTR2_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_D                             (0x3U << EPSC_NWTR2_ACCMOD_Pos)

//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK                       (0x0U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK                       (0x1U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK                       (0x2U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK                       (0x3U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK                       (0x4U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK                       (0x5U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK                       (0x6U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK                       (0x7U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK                       (0x8U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK                       (0x9U << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK                      (0xaU << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK                      (0xbU << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK                      (0xcU << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK                      (0xdU << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK                      (0xeU << EPSC_NWTR2_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK                      (0xfU << EPSC_NWTR2_BUSTURN_Pos)

//#define    FL_EPSC_NCR_SYNC_MODE_ASYNC                            (0x0U << EPSC_NCR3_CBURSTWR_Pos)
//#define    FL_EPSC_NCR_SYNC_MODE_SYNC                             (0x1U << EPSC_NCR3_CBURSTWR_Pos)

//#define    FL_EPSC_NCR_ACTIVE_STATE_BEFORE                        (0x0U << EPSC_NCR3_WAITCFG_Pos)
//#define    FL_EPSC_NCR_ACTIVE_STATE_DURING                        (0x1U << EPSC_NCR3_WAITCFG_Pos)

//#define    FL_EPSC_NCR_POLARITY_LOW                               (0x0U << EPSC_NCR3_WAITPOL_Pos)
//#define    FL_EPSC_NCR_POLARITY_HIGH                              (0x1U << EPSC_NCR3_WAITPOL_Pos)

//#define    FL_EPSC_NCR_MEMORY_WIDTH_8B                            (0x0U << EPSC_NCR3_MWID_Pos)
//#define    FL_EPSC_NCR_MEMORY_WIDTH_16B                           (0x1U << EPSC_NCR3_MWID_Pos)

//#define    FL_EPSC_NCR_MEMORY_TYPE_SRAM                           (0x0U << EPSC_NCR3_MTYP_Pos)
//#define    FL_EPSC_NCR_MEMORY_TYPE_PSRAM                          (0x1U << EPSC_NCR3_MTYP_Pos)
//#define    FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH                      (0x2U << EPSC_NCR3_MTYP_Pos)

//#define    FL_EPSC_NTR_EXTMOD_MODE_A                              (0x0U << EPSC_NTR3_ACCMOD_Pos)
//#define    FL_EPSC_NTR_EXTMOD_MODE_B                              (0x1U << EPSC_NTR3_ACCMOD_Pos)
//#define    FL_EPSC_NTR_EXTMOD_MODE_C                              (0x2U << EPSC_NTR3_ACCMOD_Pos)
//#define    FL_EPSC_NTR_EXTMOD_MODE_D                              (0x3U << EPSC_NTR3_ACCMOD_Pos)

//#define    FL_EPSC_NTR_DATA_LATENCY_2CLK                          (0x0U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_3CLK                          (0x1U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_4CLK                          (0x2U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_5CLK                          (0x3U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_6CLK                          (0x4U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_7CLK                          (0x5U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_8CLK                          (0x6U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_9CLK                          (0x7U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_10CLK                         (0x8U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_11CLK                         (0x9U << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_12CLK                         (0xaU << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_13CLK                         (0xbU << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_14CLK                         (0xcU << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_15CLK                         (0xdU << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_16CLK                         (0xeU << EPSC_NTR3_DATLAT_Pos)
//#define    FL_EPSC_NTR_DATA_LATENCY_17CLK                         (0xfU << EPSC_NTR3_DATLAT_Pos)

//#define    FL_EPSC_NTR_CLK_DIV2                                  (0x1U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV3                                  (0x2U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV4                                  (0x3U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV5                                  (0x4U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV6                                  (0x5U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV7                                  (0x6U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV8                                  (0x7U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV9                                  (0x8U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV10                                 (0x9U << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV11                                 (0xaU << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV12                                 (0xbU << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV13                                 (0xcU << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV14                                 (0xdU << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV15                                 (0xeU << EPSC_NTR3_CLKDIV_Pos)
//#define    FL_EPSC_NTR_CLK_DIV16                                 (0xfU << EPSC_NTR3_CLKDIV_Pos)

//#define    FL_EPSC_NTR_BUS_TRUNAROUND_0CLK                        (0x0U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_1CLK                        (0x1U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_2CLK                        (0x2U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_3CLK                        (0x3U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_4CLK                        (0x4U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_5CLK                        (0x5U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_6CLK                        (0x6U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_7CLK                        (0x7U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_8CLK                        (0x8U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_9CLK                        (0x9U << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_10CLK                       (0xaU << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_11CLK                       (0xbU << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_12CLK                       (0xcU << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_13CLK                       (0xdU << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_14CLK                       (0xeU << EPSC_NTR3_BUSTURN_Pos)
//#define    FL_EPSC_NTR_BUS_TRUNAROUND_15CLK                       (0xfU << EPSC_NTR3_BUSTURN_Pos)

//#define    FL_EPSC_NWTR_EXTMOD_MODE_A                             (0x0U << EPSC_NWTR3_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_B                             (0x1U << EPSC_NWTR3_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_C                             (0x2U << EPSC_NWTR3_ACCMOD_Pos)
//#define    FL_EPSC_NWTR_EXTMOD_MODE_D                             (0x3U << EPSC_NWTR3_ACCMOD_Pos)

