waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK                       (0x0U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK                       (0x1U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK                       (0x2U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK                       (0x3U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK                       (0x4U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK                       (0x5U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK                       (0x6U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK                       (0x7U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK                       (0x8U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK                       (0x9U << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK                      (0xaU << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK                      (0xbU << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK                      (0xcU << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK                      (0xdU << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK                      (0xeU << EPSC_NWTR4_BUSTURN_Pos)
//#define    FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK                      (0xfU << EPSC_NWTR4_BUSTURN_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup EPSC_FL_Exported_Functions EPSC Exported Functions
  * @{
  */

/**
  * @brief    Enable FIFO Function
  * @rmtoll   NCR1    FIFOEN    FL_EPSC_EnableNCR1_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_FIFO(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_FIFOEN_Msk);
}

/**
  * @brief    Disable FIFO Function
  * @rmtoll   NCR1    FIFOEN    FL_EPSC_DisableNCR1_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_FIFO(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_FIFOEN_Msk);
}

/**
  * @brief    Get FIFO Function Status
  * @rmtoll   NCR1    FIFOEN    FL_EPSC_IsEnabledNCR1_FIFO
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_FIFO(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_FIFOEN_Msk) == EPSC_NCR1_FIFOEN_Msk);
}

/**
  * @brief    Enable Timeout Function
  * @rmtoll   NCR1    TCEN    FL_EPSC_EnableNCR1_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_Timeout(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_TCEN_Msk);
}

/**
  * @brief    Disable Timeout Function
  * @rmtoll   NCR1    TCEN    FL_EPSC_DisableNCR1_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_Timeout(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_TCEN_Msk);
}

/**
  * @brief    Get Timeout Function Status
  * @rmtoll   NCR1    TCEN    FL_EPSC_IsEnabledNCR1_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_TCEN_Msk) == EPSC_NCR1_TCEN_Msk);
}

/**
  * @brief    Enable Contiunous CLK Function
  * @rmtoll   NCR1    CCLKEN    FL_EPSC_EnableNCR1_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_ContiunousCLK(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_CCLKEN_Msk);
}

/**
  * @brief    Disable  Contiunous CLK Function
  * @rmtoll   NCR1    CCLKEN    FL_EPSC_DisableNCR1_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_ContiunousCLK(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_CCLKEN_Msk);
}

/**
  * @brief    Get  Contiunous CLK Function Status
  * @rmtoll   NCR1    CCLKEN    FL_EPSC_IsEnabledNCR1_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_ContiunousCLK(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_CCLKEN_Msk) == EPSC_NCR1_CCLKEN_Msk);
}

/**
  * @brief    Set PSRAM write Burst Mode
  * @rmtoll   NCR1    CBURSTWR    FL_EPSC_SetNCR1_writeBurstMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR1_writeBurstMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR1, EPSC_NCR1_CBURSTWR_Msk, mode);
}

/**
  * @brief    Get PSRAM write Burst Mode
  * @rmtoll   NCR1    CBURSTWR    FL_EPSC_GetNCR1_writeBurstMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR1_writeBurstMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_CBURSTWR_Msk));
}

/**
  * @brief    Enable Asynchronous Wait Mode
  * @rmtoll   NCR1    ASYNCWAIT    FL_EPSC_EnableNCR1_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_AsynchronousWait(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_ASYNCWAIT_Msk);
}

/**
  * @brief    Disable Asynchronous Wait Mode
  * @rmtoll   NCR1    ASYNCWAIT    FL_EPSC_DisableNCR1_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_AsynchronousWait(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_ASYNCWAIT_Msk);
}

/**
  * @brief    Get Asynchronous Wait Mode Status
  * @rmtoll   NCR1    ASYNCWAIT    FL_EPSC_IsEnabledNCR1_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_AsynchronousWait(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_ASYNCWAIT_Msk) == EPSC_NCR1_ASYNCWAIT_Msk);
}

/**
  * @brief    Enable Extended Mode
  * @rmtoll   NCR1    EXTMOD    FL_EPSC_EnableNCR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_ExtendedMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_EXTMOD_Msk);
}

/**
  * @brief    Disable Extended Mode
  * @rmtoll   NCR1    EXTMOD    FL_EPSC_DisableNCR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_ExtendedMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_EXTMOD_Msk);
}

/**
  * @brief    Get Extended Mode Status
  * @rmtoll   NCR1    EXTMOD    FL_EPSC_IsEnabledNCR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_EXTMOD_Msk) == EPSC_NCR1_EXTMOD_Msk);
}

/**
  * @brief    Enable Wait Mode
  * @rmtoll   NCR1    WAITEN    FL_EPSC_EnableNCR1_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_WaitMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_WAITEN_Msk);
}

/**
  * @brief    Disable Wait Mode
  * @rmtoll   NCR1    WAITEN    FL_EPSC_DisableNCR1_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_WaitMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_WAITEN_Msk);
}

/**
  * @brief    Get Wait Mode Status
  * @rmtoll   NCR1    WAITEN    FL_EPSC_IsEnabledNCR1_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_WaitMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_WAITEN_Msk) == EPSC_NCR1_WAITEN_Msk);
}

/**
  * @brief    Enable Write Mode
  * @rmtoll   NCR1    WREN    FL_EPSC_EnableNCR1_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_WriteMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_WREN_Msk);
}

/**
  * @brief    Disable Write Mode
  * @rmtoll   NCR1    WREN    FL_EPSC_DisableNCR1_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_WriteMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_WREN_Msk);
}

/**
  * @brief    Get Write Mode Status
  * @rmtoll   NCR1    WREN    FL_EPSC_IsEnabledNCR1_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_WriteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_WREN_Msk) == EPSC_NCR1_WREN_Msk);
}

/**
  * @brief    Set Wait Timing Mode
  * @rmtoll   NCR1    WAITCFG    FL_EPSC_SetNCR1_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR1_WaitTimingMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR1, EPSC_NCR1_WAITCFG_Msk, mode);
}

/**
  * @brief    Get Wait Timing Mode
  * @rmtoll   NCR1    WAITCFG    FL_EPSC_GetNCR1_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR1_WaitTimingMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_WAITCFG_Msk));
}

/**
  * @brief    Set Wait Polarity
  * @rmtoll   NCR1    WAITPOL    FL_EPSC_SetNCR1_WaitPolarity
  * @param    EPSCx EPSC instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR1_WaitPolarity(EPSC_Type *EPSCx, uint32_t polarity)
{
    MODIFY_REG(EPSCx->NCR1, EPSC_NCR1_WAITPOL_Msk, polarity);
}

/**
  * @brief    Get Wait Polarity
  * @rmtoll   NCR1    WAITPOL    FL_EPSC_GetNCR1_WaitPolarity
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR1_WaitPolarity(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_WAITPOL_Msk));
}

/**
  * @brief    Enable Burst Mode
  * @rmtoll   NCR1    BURSTEN    FL_EPSC_EnableNCR1_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_BurstMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_BURSTEN_Msk);
}

/**
  * @brief    Disable Burst Mode
  * @rmtoll   NCR1    BURSTEN    FL_EPSC_DisableNCR1_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_BurstMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_BURSTEN_Msk);
}

/**
  * @brief    Get Burst Mode Status
  * @rmtoll   NCR1    BURSTEN    FL_EPSC_IsEnabledNCR1_BursteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_BursteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_BURSTEN_Msk) == EPSC_NCR1_BURSTEN_Msk);
}

/**
  * @brief    Set Memory Bus Width
  * @rmtoll   NCR1    MWID    FL_EPSC_SetNCR1_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @param    width This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR1_MemoryBusWidth(EPSC_Type *EPSCx, uint32_t width)
{
    MODIFY_REG(EPSCx->NCR1, EPSC_NCR1_MWID_Msk, width);
}

/**
  * @brief    Get Memory Bus Width
  * @rmtoll   NCR1    MWID    FL_EPSC_GetNCR1_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR1_MemoryBusWidth(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_MWID_Msk));
}

/**
  * @brief    Set Memory Type
  * @rmtoll   NCR1    MTYP    FL_EPSC_SetNCR1_MemoryType
  * @param    EPSCx EPSC instance
  * @param    memorytype This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR1_MemoryType(EPSC_Type *EPSCx, uint32_t memorytype)
{
    MODIFY_REG(EPSCx->NCR1, EPSC_NCR1_MTYP_Msk, memorytype);
}

/**
  * @brief    Get Memory Type
  * @rmtoll   NCR1    MTYP    FL_EPSC_GetNCR1_MemoryType
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR1_MemoryType(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_MTYP_Msk));
}

/**
  * @brief    Enable Data Address Multiplex
  * @rmtoll   NCR1    MUXEN    FL_EPSC_EnableNCR1_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_DataAddressMux(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_MUXEN_Msk);
}

/**
  * @brief    Disable Burst ModeData Address Multiplex
  * @rmtoll   NCR1    MUXEN    FL_EPSC_DisableNCR1_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_DataAddressMux(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_MUXEN_Msk);
}

/**
  * @brief    Get Data Address Multiplex  Status
  * @rmtoll   NCR1    MUXEN    FL_EPSC_IsEnabledNCR1_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_DataAddressMux(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_MUXEN_Msk) == EPSC_NCR1_MUXEN_Msk);
}

/**
  * @brief    Enable Memory Bank
  * @rmtoll   NCR1    MBKEN    FL_EPSC_EnableNCR1_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR1_MemoryBank(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR1, EPSC_NCR1_MBKEN_Msk);
}

/**
  * @brief    Disable Memory Bank
  * @rmtoll   NCR1    MBKEN    FL_EPSC_DisableNCR1_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR1_MemoryBank(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR1, EPSC_NCR1_MBKEN_Msk);
}

/**
  * @brief    Get Memory Bank Status
  * @rmtoll   NCR1    MBKEN    FL_EPSC_IsEnabledNCR1_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR1_MemoryBank(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR1, EPSC_NCR1_MBKEN_Msk) == EPSC_NCR1_MBKEN_Msk);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NTR1    ACCMOD    FL_EPSC_SetNTR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR1_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NTR1, EPSC_NTR1_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NTR1    ACCMOD    FL_EPSC_GetNTR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR1_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, EPSC_NTR1_ACCMOD_Msk));
}

/**
  * @brief    Set Data Latency Cycle
  * @rmtoll   NTR1    DATLAT    FL_EPSC_SetNTR1_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR1_DataLatencyCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR1, EPSC_NTR1_DATLAT_Msk, cyclce);
}

/**
  * @brief    Read Data Latency Cycle
  * @rmtoll   NTR1    DATLAT    FL_EPSC_GetNTR1_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR1_DataLatencyCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, EPSC_NTR1_DATLAT_Msk));
}

/**
  * @brief    Set Clk Perscale
  * @rmtoll   NTR1    CLKDIV    FL_EPSC_SetNTR1_ClkPerscale
  * @param    EPSCx EPSC instance
  * @param    Perscale This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR1_ClkPerscale(EPSC_Type *EPSCx, uint32_t Perscale)
{
    MODIFY_REG(EPSCx->NTR1, EPSC_NTR1_CLKDIV_Msk, Perscale);
}

/**
  * @brief    Read Clk Perscale
  * @rmtoll   NTR1    CLKDIV    FL_EPSC_GetNTR1_ClkPerscale
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR1_ClkPerscale(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, EPSC_NTR1_CLKDIV_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NTR1    BUSTURN    FL_EPSC_SetNTR1_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR1_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR1, EPSC_NTR1_BUSTURN_Msk, cyclce);
}

