waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NTR1    BUSTURN    FL_EPSC_GetNTR1_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR1_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, EPSC_NTR1_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NTR1    DATAST    FL_EPSC_WriteNTR1_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR1_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR1, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NTR1    DATAST    FL_EPSC_ReadNTR1_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR1_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NTR1    ADDHLD    FL_EPSC_WriteNTR1_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR1_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR1, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NTR1    ADDHLD    FL_EPSC_ReadNTR1_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR1_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NTR1    ADDSET    FL_EPSC_WriteNTR1_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR1_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR1, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NTR1    ADDSET    FL_EPSC_ReadNTR1_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR1_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR1, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NWTR1    ACCMOD    FL_EPSC_SetNWTR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR1_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NWTR1, EPSC_NWTR1_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NWTR1    ACCMOD    FL_EPSC_GetNWTR1_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR1_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR1, EPSC_NWTR1_ACCMOD_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NWTR1    BUSTURN    FL_EPSC_SetNWTR1_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR1_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NWTR1, EPSC_NWTR1_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NWTR1    BUSTURN    FL_EPSC_GetNWTR1_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR1_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR1, EPSC_NWTR1_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NWTR1    DATAST    FL_EPSC_WriteNWTR1_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR1_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR1, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NWTR1    DATAST    FL_EPSC_ReadNWTR1_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR1_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR1, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NWTR1    ADDHLD    FL_EPSC_WriteNWTR1_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR1_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR1, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NWTR1    ADDHLD    FL_EPSC_ReadNWTR1_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR1_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR1, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NWTR1    ADDSET    FL_EPSC_WriteNWTR1_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR1_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR1, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NWTR1    ADDSET    FL_EPSC_ReadNWTR1_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR1_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR1, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Enable FIFO Function
  * @rmtoll   NCR2    FIFOEN    FL_EPSC_EnableNCR2_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_FIFO(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_FIFOEN_Msk);
}

/**
  * @brief    Disable FIFO Function
  * @rmtoll   NCR2    FIFOEN    FL_EPSC_DisableNCR2_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_FIFO(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_FIFOEN_Msk);
}

/**
  * @brief    Get FIFO Function Status
  * @rmtoll   NCR2    FIFOEN    FL_EPSC_IsEnabledNCR2_FIFO
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_FIFO(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_FIFOEN_Msk) == EPSC_NCR2_FIFOEN_Msk);
}

/**
  * @brief    Enable Timeout Function
  * @rmtoll   NCR2    TCEN    FL_EPSC_EnableNCR2_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_Timeout(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_TCEN_Msk);
}

/**
  * @brief    Disable Timeout Function
  * @rmtoll   NCR2    TCEN    FL_EPSC_DisableNCR2_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_Timeout(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_TCEN_Msk);
}

/**
  * @brief    Get Timeout Function Status
  * @rmtoll   NCR2    TCEN    FL_EPSC_IsEnabledNCR2_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_TCEN_Msk) == EPSC_NCR2_TCEN_Msk);
}

/**
  * @brief    Enable Contiunous CLK Function
  * @rmtoll   NCR2    CCLKEN    FL_EPSC_EnableNCR2_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_ContiunousCLK(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_CCLKEN_Msk);
}

/**
  * @brief    Disable  Contiunous CLK Function
  * @rmtoll   NCR2    CCLKEN    FL_EPSC_DisableNCR2_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_ContiunousCLK(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_CCLKEN_Msk);
}

/**
  * @brief    Get  Contiunous CLK Function Status
  * @rmtoll   NCR2    CCLKEN    FL_EPSC_IsEnabledNCR2_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_ContiunousCLK(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_CCLKEN_Msk) == EPSC_NCR2_CCLKEN_Msk);
}

/**
  * @brief    Set PSRAM write Burst Mode
  * @rmtoll   NCR2    CBURSTWR    FL_EPSC_SetNCR2_writeBurstMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR2_writeBurstMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR2, EPSC_NCR2_CBURSTWR_Msk, mode);
}

/**
  * @brief    Get PSRAM write Burst Mode
  * @rmtoll   NCR2    CBURSTWR    FL_EPSC_GetNCR2_writeBurstMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR2_writeBurstMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_CBURSTWR_Msk));
}

/**
  * @brief    Enable Asynchronous Wait Mode
  * @rmtoll   NCR2    ASYNCWAIT    FL_EPSC_EnableNCR2_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_AsynchronousWait(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_ASYNCWAIT_Msk);
}

/**
  * @brief    Disable Asynchronous Wait Mode
  * @rmtoll   NCR2    ASYNCWAIT    FL_EPSC_DisableNCR2_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_AsynchronousWait(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_ASYNCWAIT_Msk);
}

/**
  * @brief    Get Asynchronous Wait Mode Status
  * @rmtoll   NCR2    ASYNCWAIT    FL_EPSC_IsEnabledNCR2_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_AsynchronousWait(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_ASYNCWAIT_Msk) == EPSC_NCR2_ASYNCWAIT_Msk);
}

/**
  * @brief    Enable Extended Mode
  * @rmtoll   NCR2    EXTMOD    FL_EPSC_EnableNCR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_ExtendedMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_EXTMOD_Msk);
}

/**
  * @brief    Disable Extended Mode
  * @rmtoll   NCR2    EXTMOD    FL_EPSC_DisableNCR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_ExtendedMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_EXTMOD_Msk);
}

/**
  * @brief    Get Extended Mode Status
  * @rmtoll   NCR2    EXTMOD    FL_EPSC_IsEnabledNCR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_EXTMOD_Msk) == EPSC_NCR2_EXTMOD_Msk);
}

/**
  * @brief    Enable Wait Mode
  * @rmtoll   NCR2    WAITEN    FL_EPSC_EnableNCR2_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_WaitMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_WAITEN_Msk);
}

/**
  * @brief    Disable Wait Mode
  * @rmtoll   NCR2    WAITEN    FL_EPSC_DisableNCR2_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_WaitMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_WAITEN_Msk);
}

/**
  * @brief    Get Wait Mode Status
  * @rmtoll   NCR2    WAITEN    FL_EPSC_IsEnabledNCR2_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_WaitMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_WAITEN_Msk) == EPSC_NCR2_WAITEN_Msk);
}

/**
  * @brief    Enable Write Mode
  * @rmtoll   NCR2    WREN    FL_EPSC_EnableNCR2_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_WriteMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_WREN_Msk);
}

/**
  * @brief    Disable Write Mode
  * @rmtoll   NCR2    WREN    FL_EPSC_DisableNCR2_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_WriteMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_WREN_Msk);
}

/**
  * @brief    Get Write Mode Status
  * @rmtoll   NCR2    WREN    FL_EPSC_IsEnabledNCR2_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_WriteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_WREN_Msk) == EPSC_NCR2_WREN_Msk);
}

/**
  * @brief    Set Wait Timing Mode
  * @rmtoll   NCR2    WAITCFG    FL_EPSC_SetNCR2_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR2_WaitTimingMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR2, EPSC_NCR2_WAITCFG_Msk, mode);
}

/**
  * @brief    Get Wait Timing Mode
  * @rmtoll   NCR2    WAITCFG    FL_EPSC_GetNCR2_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR2_WaitTimingMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_WAITCFG_Msk));
}

/**
  * @brief    Set Wait Polarity
  * @rmtoll   NCR2    WAITPOL    FL_EPSC_SetNCR2_WaitPolarity
  * @param    EPSCx EPSC instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR2_WaitPolarity(EPSC_Type *EPSCx, uint32_t polarity)
{
    MODIFY_REG(EPSCx->NCR2, EPSC_NCR2_WAITPOL_Msk, polarity);
}

/**
  * @brief    Get Wait Polarity
  * @rmtoll   NCR2    WAITPOL    FL_EPSC_GetNCR2_WaitPolarity
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR2_WaitPolarity(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_WAITPOL_Msk));
}

/**
  * @brief    Enable Burst Mode
  * @rmtoll   NCR2    BURSTEN    FL_EPSC_EnableNCR2_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_BurstMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_BURSTEN_Msk);
}

/**
  * @brief    Disable Burst Mode
  * @rmtoll   NCR2    BURSTEN    FL_EPSC_DisableNCR2_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_BurstMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_BURSTEN_Msk);
}

/**
  * @brief    Get Burst Mode Status
  * @rmtoll   NCR2    BURSTEN    FL_EPSC_IsEnabledNCR2_BursteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_BursteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_BURSTEN_Msk) == EPSC_NCR2_BURSTEN_Msk);
}

/**
  * @brief    Set Memory Bus Width
  * @rmtoll   NCR2    MWID    FL_EPSC_SetNCR2_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @param    width This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR2_MemoryBusWidth(EPSC_Type *EPSCx, uint32_t width)
{
    MODIFY_REG(EPSCx->NCR2, EPSC_NCR2_MWID_Msk, width);
}

/**
  * @brief    Get Memory Bus Width
  * @rmtoll   NCR2    MWID    FL_EPSC_GetNCR2_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR2_MemoryBusWidth(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_MWID_Msk));
}

/**
  * @brief    Set Memory Type
  * @rmtoll   NCR2    MTYP    FL_EPSC_SetNCR2_MemoryType
  * @param    EPSCx EPSC instance
  * @param    memorytype This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR2_MemoryType(EPSC_Type *EPSCx, uint32_t memorytype)
{
    MODIFY_REG(EPSCx->NCR2, EPSC_NCR2_MTYP_Msk, memorytype);
}

/**
  * @brief    Get Memory Type
  * @rmtoll   NCR2    MTYP    FL_EPSC_GetNCR2_MemoryType
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR2_MemoryType(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_MTYP_Msk));
}

/**
  * @brief    Enable Data Address Multiplex
  * @rmtoll   NCR2    MUXEN    FL_EPSC_EnableNCR2_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_DataAddressMux(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_MUXEN_Msk);
}

/**
  * @brief    Disable Burst ModeData Address Multiplex
  * @rmtoll   NCR2    MUXEN    FL_EPSC_DisableNCR2_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_DataAddressMux(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_MUXEN_Msk);
}

/**
  * @brief    Get Data Address Multiplex  Status
  * @rmtoll   NCR2    MUXEN    FL_EPSC_IsEnabledNCR2_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_DataAddressMux(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_MUXEN_Msk) == EPSC_NCR2_MUXEN_Msk);
}

/**
  * @brief    Enable Memory Bank
  * @rmtoll   NCR2    MBKEN    FL_EPSC_EnableNCR2_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR2_MemoryBank(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR2, EPSC_NCR2_MBKEN_Msk);
}

/**
  * @brief    Disable Memory Bank
  * @rmtoll   NCR2    MBKEN    FL_EPSC_DisableNCR2_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR2_MemoryBank(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR2, EPSC_NCR2_MBKEN_Msk);
}

/**
  * @brief    Get Memory Bank Status
  * @rmtoll   NCR2    MBKEN    FL_EPSC_IsEnabledNCR2_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR2_MemoryBank(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR2, EPSC_NCR2_MBKEN_Msk) == EPSC_NCR2_MBKEN_Msk);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NTR2    ACCMOD    FL_EPSC_SetNTR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR2_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NTR2, EPSC_NTR2_ACCMOD_Msk, mode);
}

