waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  * @brief    Read Extended Mode
  * @rmtoll   NTR2    ACCMOD    FL_EPSC_GetNTR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR2_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, EPSC_NTR2_ACCMOD_Msk));
}

/**
  * @brief    Set Data Latency Cycle
  * @rmtoll   NTR2    DATLAT    FL_EPSC_SetNTR2_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR2_DataLatencyCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR2, EPSC_NTR2_DATLAT_Msk, cyclce);
}

/**
  * @brief    Read Data Latency Cycle
  * @rmtoll   NTR2    DATLAT    FL_EPSC_GetNTR2_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR2_DataLatencyCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, EPSC_NTR2_DATLAT_Msk));
}

/**
  * @brief    Set Clk Perscale
  * @rmtoll   NTR2    CLKDIV    FL_EPSC_SetNTR2_ClkPerscale
  * @param    EPSCx EPSC instance
  * @param    Perscale This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR2_ClkPerscale(EPSC_Type *EPSCx, uint32_t Perscale)
{
    MODIFY_REG(EPSCx->NTR2, EPSC_NTR2_CLKDIV_Msk, Perscale);
}

/**
  * @brief    Read Clk Perscale
  * @rmtoll   NTR2    CLKDIV    FL_EPSC_GetNTR2_ClkPerscale
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR2_ClkPerscale(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, EPSC_NTR2_CLKDIV_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NTR2    BUSTURN    FL_EPSC_SetNTR2_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR2_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR2, EPSC_NTR2_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NTR2    BUSTURN    FL_EPSC_GetNTR2_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR2_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, EPSC_NTR2_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NTR2    DATAST    FL_EPSC_WriteNTR2_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR2_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR2, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NTR2    DATAST    FL_EPSC_ReadNTR2_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR2_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NTR2    ADDHLD    FL_EPSC_WriteNTR2_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR2_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR2, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NTR2    ADDHLD    FL_EPSC_ReadNTR2_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR2_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NTR2    ADDSET    FL_EPSC_WriteNTR2_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR2_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR2, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NTR2    ADDSET    FL_EPSC_ReadNTR2_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR2_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR2, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NWTR2    ACCMOD    FL_EPSC_SetNWTR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR2_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NWTR2, EPSC_NWTR2_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NWTR2    ACCMOD    FL_EPSC_GetNWTR2_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR2_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR2, EPSC_NWTR2_ACCMOD_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NWTR2    BUSTURN    FL_EPSC_SetNWTR2_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR2_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NWTR2, EPSC_NWTR2_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NWTR2    BUSTURN    FL_EPSC_GetNWTR2_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR2_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR2, EPSC_NWTR2_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NWTR2    DATAST    FL_EPSC_WriteNWTR2_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR2_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR2, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NWTR2    DATAST    FL_EPSC_ReadNWTR2_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR2_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR2, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NWTR2    ADDHLD    FL_EPSC_WriteNWTR2_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR2_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR2, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NWTR2    ADDHLD    FL_EPSC_ReadNWTR2_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR2_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR2, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NWTR2    ADDSET    FL_EPSC_WriteNWTR2_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR2_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR2, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NWTR2    ADDSET    FL_EPSC_ReadNWTR2_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR2_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR2, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Enable FIFO Function
  * @rmtoll   NCR3    FIFOEN    FL_EPSC_EnableNCR3_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_FIFO(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_FIFOEN_Msk);
}

/**
  * @brief    Disable FIFO Function
  * @rmtoll   NCR3    FIFOEN    FL_EPSC_DisableNCR3_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_FIFO(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_FIFOEN_Msk);
}

/**
  * @brief    Get FIFO Function Status
  * @rmtoll   NCR3    FIFOEN    FL_EPSC_IsEnabledNCR3_FIFO
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_FIFO(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_FIFOEN_Msk) == EPSC_NCR3_FIFOEN_Msk);
}

/**
  * @brief    Enable Timeout Function
  * @rmtoll   NCR3    TCEN    FL_EPSC_EnableNCR3_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_Timeout(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_TCEN_Msk);
}

/**
  * @brief    Disable Timeout Function
  * @rmtoll   NCR3    TCEN    FL_EPSC_DisableNCR3_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_Timeout(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_TCEN_Msk);
}

/**
  * @brief    Get Timeout Function Status
  * @rmtoll   NCR3    TCEN    FL_EPSC_IsEnabledNCR3_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_TCEN_Msk) == EPSC_NCR3_TCEN_Msk);
}

/**
  * @brief    Enable Contiunous CLK Function
  * @rmtoll   NCR3    CCLKEN    FL_EPSC_EnableNCR3_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_ContiunousCLK(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_CCLKEN_Msk);
}

/**
  * @brief    Disable  Contiunous CLK Function
  * @rmtoll   NCR3    CCLKEN    FL_EPSC_DisableNCR3_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_ContiunousCLK(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_CCLKEN_Msk);
}

/**
  * @brief    Get  Contiunous CLK Function Status
  * @rmtoll   NCR3    CCLKEN    FL_EPSC_IsEnabledNCR3_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_ContiunousCLK(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_CCLKEN_Msk) == EPSC_NCR3_CCLKEN_Msk);
}

/**
  * @brief    Set PSRAM write Burst Mode
  * @rmtoll   NCR3    CBURSTWR    FL_EPSC_SetNCR3_writeBurstMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR3_writeBurstMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR3, EPSC_NCR3_CBURSTWR_Msk, mode);
}

/**
  * @brief    Get PSRAM write Burst Mode
  * @rmtoll   NCR3    CBURSTWR    FL_EPSC_GetNCR3_writeBurstMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR3_writeBurstMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_CBURSTWR_Msk));
}

/**
  * @brief    Enable Asynchronous Wait Mode
  * @rmtoll   NCR3    ASYNCWAIT    FL_EPSC_EnableNCR3_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_AsynchronousWait(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_ASYNCWAIT_Msk);
}

/**
  * @brief    Disable Asynchronous Wait Mode
  * @rmtoll   NCR3    ASYNCWAIT    FL_EPSC_DisableNCR3_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_AsynchronousWait(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_ASYNCWAIT_Msk);
}

/**
  * @brief    Get Asynchronous Wait Mode Status
  * @rmtoll   NCR3    ASYNCWAIT    FL_EPSC_IsEnabledNCR3_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_AsynchronousWait(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_ASYNCWAIT_Msk) == EPSC_NCR3_ASYNCWAIT_Msk);
}

/**
  * @brief    Enable Extended Mode
  * @rmtoll   NCR3    EXTMOD    FL_EPSC_EnableNCR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_ExtendedMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_EXTMOD_Msk);
}

/**
  * @brief    Disable Extended Mode
  * @rmtoll   NCR3    EXTMOD    FL_EPSC_DisableNCR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_ExtendedMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_EXTMOD_Msk);
}

/**
  * @brief    Get Extended Mode Status
  * @rmtoll   NCR3    EXTMOD    FL_EPSC_IsEnabledNCR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_EXTMOD_Msk) == EPSC_NCR3_EXTMOD_Msk);
}

/**
  * @brief    Enable Wait Mode
  * @rmtoll   NCR3    WAITEN    FL_EPSC_EnableNCR3_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_WaitMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_WAITEN_Msk);
}

/**
  * @brief    Disable Wait Mode
  * @rmtoll   NCR3    WAITEN    FL_EPSC_DisableNCR3_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_WaitMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_WAITEN_Msk);
}

/**
  * @brief    Get Wait Mode Status
  * @rmtoll   NCR3    WAITEN    FL_EPSC_IsEnabledNCR3_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_WaitMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_WAITEN_Msk) == EPSC_NCR3_WAITEN_Msk);
}

/**
  * @brief    Enable Write Mode
  * @rmtoll   NCR3    WREN    FL_EPSC_EnableNCR3_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_WriteMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_WREN_Msk);
}

/**
  * @brief    Disable Write Mode
  * @rmtoll   NCR3    WREN    FL_EPSC_DisableNCR3_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_WriteMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_WREN_Msk);
}

/**
  * @brief    Get Write Mode Status
  * @rmtoll   NCR3    WREN    FL_EPSC_IsEnabledNCR3_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_WriteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_WREN_Msk) == EPSC_NCR3_WREN_Msk);
}

/**
  * @brief    Set Wait Timing Mode
  * @rmtoll   NCR3    WAITCFG    FL_EPSC_SetNCR3_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR3_WaitTimingMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR3, EPSC_NCR3_WAITCFG_Msk, mode);
}

/**
  * @brief    Get Wait Timing Mode
  * @rmtoll   NCR3    WAITCFG    FL_EPSC_GetNCR3_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR3_WaitTimingMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_WAITCFG_Msk));
}

