waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  * @brief    Set Wait Polarity
  * @rmtoll   NCR3    WAITPOL    FL_EPSC_SetNCR3_WaitPolarity
  * @param    EPSCx EPSC instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR3_WaitPolarity(EPSC_Type *EPSCx, uint32_t polarity)
{
    MODIFY_REG(EPSCx->NCR3, EPSC_NCR3_WAITPOL_Msk, polarity);
}

/**
  * @brief    Get Wait Polarity
  * @rmtoll   NCR3    WAITPOL    FL_EPSC_GetNCR3_WaitPolarity
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR3_WaitPolarity(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_WAITPOL_Msk));
}

/**
  * @brief    Enable Burst Mode
  * @rmtoll   NCR3    BURSTEN    FL_EPSC_EnableNCR3_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_BurstMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_BURSTEN_Msk);
}

/**
  * @brief    Disable Burst Mode
  * @rmtoll   NCR3    BURSTEN    FL_EPSC_DisableNCR3_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_BurstMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_BURSTEN_Msk);
}

/**
  * @brief    Get Burst Mode Status
  * @rmtoll   NCR3    BURSTEN    FL_EPSC_IsEnabledNCR3_BursteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_BursteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_BURSTEN_Msk) == EPSC_NCR3_BURSTEN_Msk);
}

/**
  * @brief    Set Memory Bus Width
  * @rmtoll   NCR3    MWID    FL_EPSC_SetNCR3_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @param    width This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR3_MemoryBusWidth(EPSC_Type *EPSCx, uint32_t width)
{
    MODIFY_REG(EPSCx->NCR3, EPSC_NCR3_MWID_Msk, width);
}

/**
  * @brief    Get Memory Bus Width
  * @rmtoll   NCR3    MWID    FL_EPSC_GetNCR3_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR3_MemoryBusWidth(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_MWID_Msk));
}

/**
  * @brief    Set Memory Type
  * @rmtoll   NCR3    MTYP    FL_EPSC_SetNCR3_MemoryType
  * @param    EPSCx EPSC instance
  * @param    memorytype This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR3_MemoryType(EPSC_Type *EPSCx, uint32_t memorytype)
{
    MODIFY_REG(EPSCx->NCR3, EPSC_NCR3_MTYP_Msk, memorytype);
}

/**
  * @brief    Get Memory Type
  * @rmtoll   NCR3    MTYP    FL_EPSC_GetNCR3_MemoryType
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR3_MemoryType(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_MTYP_Msk));
}

/**
  * @brief    Enable Data Address Multiplex
  * @rmtoll   NCR3    MUXEN    FL_EPSC_EnableNCR3_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_DataAddressMux(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_MUXEN_Msk);
}

/**
  * @brief    Disable Burst ModeData Address Multiplex
  * @rmtoll   NCR3    MUXEN    FL_EPSC_DisableNCR3_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_DataAddressMux(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_MUXEN_Msk);
}

/**
  * @brief    Get Data Address Multiplex  Status
  * @rmtoll   NCR3    MUXEN    FL_EPSC_IsEnabledNCR3_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_DataAddressMux(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_MUXEN_Msk) == EPSC_NCR3_MUXEN_Msk);
}

/**
  * @brief    Enable Memory Bank
  * @rmtoll   NCR3    MBKEN    FL_EPSC_EnableNCR3_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR3_MemoryBank(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR3, EPSC_NCR3_MBKEN_Msk);
}

/**
  * @brief    Disable Memory Bank
  * @rmtoll   NCR3    MBKEN    FL_EPSC_DisableNCR3_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR3_MemoryBank(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR3, EPSC_NCR3_MBKEN_Msk);
}

/**
  * @brief    Get Memory Bank Status
  * @rmtoll   NCR3    MBKEN    FL_EPSC_IsEnabledNCR3_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR3_MemoryBank(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR3, EPSC_NCR3_MBKEN_Msk) == EPSC_NCR3_MBKEN_Msk);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NTR3    ACCMOD    FL_EPSC_SetNTR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR3_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NTR3, EPSC_NTR3_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NTR3    ACCMOD    FL_EPSC_GetNTR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR3_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, EPSC_NTR3_ACCMOD_Msk));
}

/**
  * @brief    Set Data Latency Cycle
  * @rmtoll   NTR3    DATLAT    FL_EPSC_SetNTR3_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR3_DataLatencyCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR3, EPSC_NTR3_DATLAT_Msk, cyclce);
}

/**
  * @brief    Read Data Latency Cycle
  * @rmtoll   NTR3    DATLAT    FL_EPSC_GetNTR3_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR3_DataLatencyCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, EPSC_NTR3_DATLAT_Msk));
}

/**
  * @brief    Set Clk Perscale
  * @rmtoll   NTR3    CLKDIV    FL_EPSC_SetNTR3_ClkPerscale
  * @param    EPSCx EPSC instance
  * @param    Perscale This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR3_ClkPerscale(EPSC_Type *EPSCx, uint32_t Perscale)
{
    MODIFY_REG(EPSCx->NTR3, EPSC_NTR3_CLKDIV_Msk, Perscale);
}

/**
  * @brief    Read Clk Perscale
  * @rmtoll   NTR3    CLKDIV    FL_EPSC_GetNTR3_ClkPerscale
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR3_ClkPerscale(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, EPSC_NTR3_CLKDIV_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NTR3    BUSTURN    FL_EPSC_SetNTR3_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR3_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR3, EPSC_NTR3_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NTR3    BUSTURN    FL_EPSC_GetNTR3_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR3_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, EPSC_NTR3_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NTR3    DATAST    FL_EPSC_WriteNTR3_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR3_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR3, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NTR3    DATAST    FL_EPSC_ReadNTR3_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR3_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NTR3    ADDHLD    FL_EPSC_WriteNTR3_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR3_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR3, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NTR3    ADDHLD    FL_EPSC_ReadNTR3_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR3_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NTR3    ADDSET    FL_EPSC_WriteNTR3_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR3_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR3, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NTR3    ADDSET    FL_EPSC_ReadNTR3_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR3_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR3, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NWTR3    ACCMOD    FL_EPSC_SetNWTR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR3_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NWTR3, EPSC_NWTR3_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NWTR3    ACCMOD    FL_EPSC_GetNWTR3_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR3_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR3, EPSC_NWTR3_ACCMOD_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NWTR3    BUSTURN    FL_EPSC_SetNWTR3_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR3_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NWTR3, EPSC_NWTR3_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NWTR3    BUSTURN    FL_EPSC_GetNWTR3_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR3_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR3, EPSC_NWTR3_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NWTR3    DATAST    FL_EPSC_WriteNWTR3_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR3_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR3, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NWTR3    DATAST    FL_EPSC_ReadNWTR3_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR3_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR3, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NWTR3    ADDHLD    FL_EPSC_WriteNWTR3_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR3_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR3, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NWTR3    ADDHLD    FL_EPSC_ReadNWTR3_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR3_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR3, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NWTR3    ADDSET    FL_EPSC_WriteNWTR3_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR3_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR3, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NWTR3    ADDSET    FL_EPSC_ReadNWTR3_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR3_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR3, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Enable FIFO Function
  * @rmtoll   NCR4    FIFOEN    FL_EPSC_EnableNCR4_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_FIFO(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_FIFOEN_Msk);
}

/**
  * @brief    Disable FIFO Function
  * @rmtoll   NCR4    FIFOEN    FL_EPSC_DisableNCR4_FIFO
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_FIFO(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_FIFOEN_Msk);
}

/**
  * @brief    Get FIFO Function Status
  * @rmtoll   NCR4    FIFOEN    FL_EPSC_IsEnabledNCR4_FIFO
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_FIFO(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_FIFOEN_Msk) == EPSC_NCR4_FIFOEN_Msk);
}

/**
  * @brief    Enable Timeout Function
  * @rmtoll   NCR4    TCEN    FL_EPSC_EnableNCR4_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_Timeout(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_TCEN_Msk);
}

/**
  * @brief    Disable Timeout Function
  * @rmtoll   NCR4    TCEN    FL_EPSC_DisableNCR4_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_Timeout(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_TCEN_Msk);
}

/**
  * @brief    Get Timeout Function Status
  * @rmtoll   NCR4    TCEN    FL_EPSC_IsEnabledNCR4_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_TCEN_Msk) == EPSC_NCR4_TCEN_Msk);
}

/**
  * @brief    Enable Contiunous CLK Function
  * @rmtoll   NCR4    CCLKEN    FL_EPSC_EnableNCR4_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_ContiunousCLK(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_CCLKEN_Msk);
}

/**
  * @brief    Disable  Contiunous CLK Function
  * @rmtoll   NCR4    CCLKEN    FL_EPSC_DisableNCR4_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_ContiunousCLK(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_CCLKEN_Msk);
}

