waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  * @brief    Get  Contiunous CLK Function Status
  * @rmtoll   NCR4    CCLKEN    FL_EPSC_IsEnabledNCR4_ContiunousCLK
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_ContiunousCLK(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_CCLKEN_Msk) == EPSC_NCR4_CCLKEN_Msk);
}

/**
  * @brief    Set PSRAM write Burst Mode
  * @rmtoll   NCR4    CBURSTWR    FL_EPSC_SetNCR4_writeBurstMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR4_writeBurstMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR4, EPSC_NCR4_CBURSTWR_Msk, mode);
}

/**
  * @brief    Get PSRAM write Burst Mode
  * @rmtoll   NCR4    CBURSTWR    FL_EPSC_GetNCR4_writeBurstMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_ASYNC
  *           @arg @ref FL_EPSC_NCR_SYNC_MODE_SYNC
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR4_writeBurstMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_CBURSTWR_Msk));
}

/**
  * @brief    Enable Asynchronous Wait Mode
  * @rmtoll   NCR4    ASYNCWAIT    FL_EPSC_EnableNCR4_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_AsynchronousWait(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_ASYNCWAIT_Msk);
}

/**
  * @brief    Disable Asynchronous Wait Mode
  * @rmtoll   NCR4    ASYNCWAIT    FL_EPSC_DisableNCR4_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_AsynchronousWait(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_ASYNCWAIT_Msk);
}

/**
  * @brief    Get Asynchronous Wait Mode Status
  * @rmtoll   NCR4    ASYNCWAIT    FL_EPSC_IsEnabledNCR4_AsynchronousWait
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_AsynchronousWait(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_ASYNCWAIT_Msk) == EPSC_NCR4_ASYNCWAIT_Msk);
}

/**
  * @brief    Enable Extended Mode
  * @rmtoll   NCR4    EXTMOD    FL_EPSC_EnableNCR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_ExtendedMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_EXTMOD_Msk);
}

/**
  * @brief    Disable Extended Mode
  * @rmtoll   NCR4    EXTMOD    FL_EPSC_DisableNCR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_ExtendedMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_EXTMOD_Msk);
}

/**
  * @brief    Get Extended Mode Status
  * @rmtoll   NCR4    EXTMOD    FL_EPSC_IsEnabledNCR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_EXTMOD_Msk) == EPSC_NCR4_EXTMOD_Msk);
}

/**
  * @brief    Enable Wait Mode
  * @rmtoll   NCR4    WAITEN    FL_EPSC_EnableNCR4_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_WaitMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_WAITEN_Msk);
}

/**
  * @brief    Disable Wait Mode
  * @rmtoll   NCR4    WAITEN    FL_EPSC_DisableNCR4_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_WaitMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_WAITEN_Msk);
}

/**
  * @brief    Get Wait Mode Status
  * @rmtoll   NCR4    WAITEN    FL_EPSC_IsEnabledNCR4_WaitMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_WaitMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_WAITEN_Msk) == EPSC_NCR4_WAITEN_Msk);
}

/**
  * @brief    Enable Write Mode
  * @rmtoll   NCR4    WREN    FL_EPSC_EnableNCR4_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_WriteMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_WREN_Msk);
}

/**
  * @brief    Disable Write Mode
  * @rmtoll   NCR4    WREN    FL_EPSC_DisableNCR4_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_WriteMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_WREN_Msk);
}

/**
  * @brief    Get Write Mode Status
  * @rmtoll   NCR4    WREN    FL_EPSC_IsEnabledNCR4_WriteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_WriteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_WREN_Msk) == EPSC_NCR4_WREN_Msk);
}

/**
  * @brief    Set Wait Timing Mode
  * @rmtoll   NCR4    WAITCFG    FL_EPSC_SetNCR4_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR4_WaitTimingMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NCR4, EPSC_NCR4_WAITCFG_Msk, mode);
}

/**
  * @brief    Get Wait Timing Mode
  * @rmtoll   NCR4    WAITCFG    FL_EPSC_GetNCR4_WaitTimingMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_BEFORE
  *           @arg @ref FL_EPSC_NCR_ACTIVE_STATE_DURING
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR4_WaitTimingMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_WAITCFG_Msk));
}

/**
  * @brief    Set Wait Polarity
  * @rmtoll   NCR4    WAITPOL    FL_EPSC_SetNCR4_WaitPolarity
  * @param    EPSCx EPSC instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR4_WaitPolarity(EPSC_Type *EPSCx, uint32_t polarity)
{
    MODIFY_REG(EPSCx->NCR4, EPSC_NCR4_WAITPOL_Msk, polarity);
}

/**
  * @brief    Get Wait Polarity
  * @rmtoll   NCR4    WAITPOL    FL_EPSC_GetNCR4_WaitPolarity
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_POLARITY_LOW
  *           @arg @ref FL_EPSC_NCR_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR4_WaitPolarity(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_WAITPOL_Msk));
}

/**
  * @brief    Enable Burst Mode
  * @rmtoll   NCR4    BURSTEN    FL_EPSC_EnableNCR4_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_BurstMode(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_BURSTEN_Msk);
}

/**
  * @brief    Disable Burst Mode
  * @rmtoll   NCR4    BURSTEN    FL_EPSC_DisableNCR4_BurstMode
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_BurstMode(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_BURSTEN_Msk);
}

/**
  * @brief    Get Burst Mode Status
  * @rmtoll   NCR4    BURSTEN    FL_EPSC_IsEnabledNCR4_BursteMode
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_BursteMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_BURSTEN_Msk) == EPSC_NCR4_BURSTEN_Msk);
}

/**
  * @brief    Set Memory Bus Width
  * @rmtoll   NCR4    MWID    FL_EPSC_SetNCR4_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @param    width This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR4_MemoryBusWidth(EPSC_Type *EPSCx, uint32_t width)
{
    MODIFY_REG(EPSCx->NCR4, EPSC_NCR4_MWID_Msk, width);
}

/**
  * @brief    Get Memory Bus Width
  * @rmtoll   NCR4    MWID    FL_EPSC_GetNCR4_MemoryBusWidth
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_8B
  *           @arg @ref FL_EPSC_NCR_MEMORY_WIDTH_16B
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR4_MemoryBusWidth(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_MWID_Msk));
}

/**
  * @brief    Set Memory Type
  * @rmtoll   NCR4    MTYP    FL_EPSC_SetNCR4_MemoryType
  * @param    EPSCx EPSC instance
  * @param    memorytype This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNCR4_MemoryType(EPSC_Type *EPSCx, uint32_t memorytype)
{
    MODIFY_REG(EPSCx->NCR4, EPSC_NCR4_MTYP_Msk, memorytype);
}

/**
  * @brief    Get Memory Type
  * @rmtoll   NCR4    MTYP    FL_EPSC_GetNCR4_MemoryType
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_SRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_PSRAM
  *           @arg @ref FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNCR4_MemoryType(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_MTYP_Msk));
}

/**
  * @brief    Enable Data Address Multiplex
  * @rmtoll   NCR4    MUXEN    FL_EPSC_EnableNCR4_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_DataAddressMux(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_MUXEN_Msk);
}

/**
  * @brief    Disable Burst ModeData Address Multiplex
  * @rmtoll   NCR4    MUXEN    FL_EPSC_DisableNCR4_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_DataAddressMux(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_MUXEN_Msk);
}

/**
  * @brief    Get Data Address Multiplex  Status
  * @rmtoll   NCR4    MUXEN    FL_EPSC_IsEnabledNCR4_DataAddressMux
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_DataAddressMux(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_MUXEN_Msk) == EPSC_NCR4_MUXEN_Msk);
}

/**
  * @brief    Enable Memory Bank
  * @rmtoll   NCR4    MBKEN    FL_EPSC_EnableNCR4_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableNCR4_MemoryBank(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->NCR4, EPSC_NCR4_MBKEN_Msk);
}

/**
  * @brief    Disable Memory Bank
  * @rmtoll   NCR4    MBKEN    FL_EPSC_DisableNCR4_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_DisableNCR4_MemoryBank(EPSC_Type *EPSCx)
{
    CLEAR_BIT(EPSCx->NCR4, EPSC_NCR4_MBKEN_Msk);
}

/**
  * @brief    Get Memory Bank Status
  * @rmtoll   NCR4    MBKEN    FL_EPSC_IsEnabledNCR4_MemoryBank
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledNCR4_MemoryBank(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NCR4, EPSC_NCR4_MBKEN_Msk) == EPSC_NCR4_MBKEN_Msk);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NTR4    ACCMOD    FL_EPSC_SetNTR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR4_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NTR4, EPSC_NTR4_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NTR4    ACCMOD    FL_EPSC_GetNTR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR4_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, EPSC_NTR4_ACCMOD_Msk));
}

/**
  * @brief    Set Data Latency Cycle
  * @rmtoll   NTR4    DATLAT    FL_EPSC_SetNTR4_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR4_DataLatencyCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR4, EPSC_NTR4_DATLAT_Msk, cyclce);
}

/**
  * @brief    Read Data Latency Cycle
  * @rmtoll   NTR4    DATLAT    FL_EPSC_GetNTR4_DataLatencyCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_2CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_3CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_4CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_5CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_6CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_7CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_8CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_9CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_10CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_11CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_12CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_13CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_14CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_15CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_16CLK
  *           @arg @ref FL_EPSC_NTR_DATA_LATENCY_17CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR4_DataLatencyCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, EPSC_NTR4_DATLAT_Msk));
}

/**
  * @brief    Set Clk Perscale
  * @rmtoll   NTR4    CLKDIV    FL_EPSC_SetNTR4_ClkPerscale
  * @param    EPSCx EPSC instance
  * @param    Perscale This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR4_ClkPerscale(EPSC_Type *EPSCx, uint32_t Perscale)
{
    MODIFY_REG(EPSCx->NTR4, EPSC_NTR4_CLKDIV_Msk, Perscale);
}

/**
  * @brief    Read Clk Perscale
  * @rmtoll   NTR4    CLKDIV    FL_EPSC_GetNTR4_ClkPerscale
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_CLK_DIV2
  *           @arg @ref FL_EPSC_NTR_CLK_DIV3
  *           @arg @ref FL_EPSC_NTR_CLK_DIV4
  *           @arg @ref FL_EPSC_NTR_CLK_DIV5
  *           @arg @ref FL_EPSC_NTR_CLK_DIV6
  *           @arg @ref FL_EPSC_NTR_CLK_DIV7
  *           @arg @ref FL_EPSC_NTR_CLK_DIV8
  *           @arg @ref FL_EPSC_NTR_CLK_DIV9
  *           @arg @ref FL_EPSC_NTR_CLK_DIV10
  *           @arg @ref FL_EPSC_NTR_CLK_DIV11
  *           @arg @ref FL_EPSC_NTR_CLK_DIV12
  *           @arg @ref FL_EPSC_NTR_CLK_DIV13
  *           @arg @ref FL_EPSC_NTR_CLK_DIV14
  *           @arg @ref FL_EPSC_NTR_CLK_DIV15
  *           @arg @ref FL_EPSC_NTR_CLK_DIV16
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR4_ClkPerscale(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, EPSC_NTR4_CLKDIV_Msk));
}

/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NTR4    BUSTURN    FL_EPSC_SetNTR4_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNTR4_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NTR4, EPSC_NTR4_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NTR4    BUSTURN    FL_EPSC_GetNTR4_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNTR4_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, EPSC_NTR4_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NTR4    DATAST    FL_EPSC_WriteNTR4_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR4_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR4, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NTR4    DATAST    FL_EPSC_ReadNTR4_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR4_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NTR4    ADDHLD    FL_EPSC_WriteNTR4_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR4_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR4, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NTR4    ADDHLD    FL_EPSC_ReadNTR4_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR4_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NTR4    ADDSET    FL_EPSC_WriteNTR4_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNTR4_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NTR4, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NTR4    ADDSET    FL_EPSC_ReadNTR4_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNTR4_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NTR4, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Set Extended Mode
  * @rmtoll   NWTR4    ACCMOD    FL_EPSC_SetNWTR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR4_ExtendedMode(EPSC_Type *EPSCx, uint32_t mode)
{
    MODIFY_REG(EPSCx->NWTR4, EPSC_NWTR4_ACCMOD_Msk, mode);
}

/**
  * @brief    Read Extended Mode
  * @rmtoll   NWTR4    ACCMOD    FL_EPSC_GetNWTR4_ExtendedMode
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_A
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_B
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_C
  *           @arg @ref FL_EPSC_NWTR_EXTMOD_MODE_D
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR4_ExtendedMode(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR4, EPSC_NWTR4_ACCMOD_Msk));
}

