waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_epsc.h
/**
  * @brief    Set Bus Turnaround Cycle
  * @rmtoll   NWTR4    BUSTURN    FL_EPSC_SetNWTR4_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @param    cyclce This parameter can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_SetNWTR4_BusTurnaroundCycle(EPSC_Type *EPSCx, uint32_t cyclce)
{
    MODIFY_REG(EPSCx->NWTR4, EPSC_NWTR4_BUSTURN_Msk, cyclce);
}

/**
  * @brief    Read Bus Turnaround Cycle
  * @rmtoll   NWTR4    BUSTURN    FL_EPSC_GetNWTR4_BusTurnaroundCycle
  * @param    EPSCx EPSC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK
  *           @arg @ref FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK
  */
__STATIC_INLINE uint32_t FL_EPSC_GetNWTR4_BusTurnaroundCycle(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR4, EPSC_NWTR4_BUSTURN_Msk));
}

/**
  * @brief    Write Data State Value
  * @rmtoll   NWTR4    DATAST    FL_EPSC_WriteNWTR4_DataState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR4_DataState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR4, (0xffU << 8U), (clk << 8U));
}

/**
  * @brief    Get Data State Value
  * @rmtoll   NWTR4    DATAST    FL_EPSC_ReadNWTR4_DataState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR4_DataState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR4, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Write Address Hold State Value
  * @rmtoll   NWTR4    ADDHLD    FL_EPSC_WriteNWTR4_AddressHoldState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR4_AddressHoldState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR4, (0xfU << 4U), (clk << 4U));
}

/**
  * @brief    Get Address Hold State Value
  * @rmtoll   NWTR4    ADDHLD    FL_EPSC_ReadNWTR4_AddressHoldState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR4_AddressHoldState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR4, (0xfU << 4U)) >> 4U);
}

/**
  * @brief    Write Address Set State Value
  * @rmtoll   NWTR4    ADDSET    FL_EPSC_WriteNWTR4_AddressSetState
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteNWTR4_AddressSetState(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->NWTR4, (0xfU << 0U), (clk << 0U));
}

/**
  * @brief    Get Address Set State Value
  * @rmtoll   NWTR4    ADDSET    FL_EPSC_ReadNWTR4_AddressSetState
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadNWTR4_AddressSetState(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->NWTR4, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Clear FIFO FULL Flag
  * @rmtoll   ISR    FULL    FL_EPSC_ClearFlag_FIFOFull
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_FIFOFull(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_FULL_Msk);
}

/**
  * @brief    Get FIFO FULL Flag
  * @rmtoll   ISR    FULL    FL_EPSC_IsActiveFlag_FIFOFull
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_FIFOFull(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_FULL_Msk) == (EPSC_ISR_FULL_Msk));
}

/**
  * @brief    Clear FIFO Half FULL Flag
  * @rmtoll   ISR    HALF_FULL    FL_EPSC_ClearFlag_FIFOHalfFull
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_FIFOHalfFull(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_HALF_FULL_Msk);
}

/**
  * @brief    Get FIFO Half FULL Flag
  * @rmtoll   ISR    HALF_FULL    FL_EPSC_IsActiveFlag_FIFOHalfFull
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_FIFOHalfFull(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_HALF_FULL_Msk) == (EPSC_ISR_HALF_FULL_Msk));
}

/**
  * @brief    Clear Transfer Completed Flag
  * @rmtoll   ISR    TCF    FL_EPSC_ClearFlag_TransferCompleted
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_TransferCompleted(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_TCF_Msk);
}

/**
  * @brief    Get Transfer Completed Flag
  * @rmtoll   ISR    TCF    FL_EPSC_IsActiveFlag_TransferCompleted
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_TransferCompleted(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_TCF_Msk) == (EPSC_ISR_TCF_Msk));
}

/**
  * @brief    Clear Transfer Error Flag
  * @rmtoll   ISR    TEF    FL_EPSC_ClearFlag_TransferError
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_TransferError(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_TEF_Msk);
}

/**
  * @brief    Get Transfer Error Flag
  * @rmtoll   ISR    TEF    FL_EPSC_IsActiveFlag_TransferError
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_TransferError(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_TEF_Msk) == (EPSC_ISR_TEF_Msk));
}

/**
  * @brief    Get Transfer Busy Flag
  * @rmtoll   ISR    BUSY    FL_EPSC_IsActiveFlag_Busy
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_Busy(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_BUSY_Msk) == (EPSC_ISR_BUSY_Msk));
}

/**
  * @brief    Clear Timeout Flag
  * @rmtoll   ISR    TOF    FL_EPSC_ClearFlag_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_Timeout(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_TOF_Msk);
}

/**
  * @brief    Get Timeout Flag
  * @rmtoll   ISR    TOF    FL_EPSC_IsActiveFlag_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_TOF_Msk) == (EPSC_ISR_TOF_Msk));
}

/**
  * @brief    Clear NE Rise Edge Flag
  * @rmtoll   ISR    NER    FL_EPSC_ClearFlag_NERiseEdge
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_NERiseEdge(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_NER_Msk);
}

/**
  * @brief    Get NE Rise Edge  Flag
  * @rmtoll   ISR    NER    FL_EPSC_IsActiveFlag_NERiseEdge
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_NERiseEdge(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_NER_Msk) == (EPSC_ISR_NER_Msk));
}

/**
  * @brief    Clear NE Fall Edge Flag
  * @rmtoll   ISR    NEF    FL_EPSC_ClearFlag_NEFallEdge
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_NEFallEdge(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_NEF_Msk);
}

/**
  * @brief    Get NE Fall Edge Flag
  * @rmtoll   ISR    NEF    FL_EPSC_IsActiveFlag_NEFallEdge
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_NEFallEdge(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_NEF_Msk) == (EPSC_ISR_NEF_Msk));
}

/**
  * @brief    Clear FIFO Empty Flag
  * @rmtoll   ISR    FEMPT    FL_EPSC_ClearFlag_FIFOEmpty
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_ClearFlag_FIFOEmpty(EPSC_Type *EPSCx)
{
    WRITE_REG(EPSCx->ISR, EPSC_ISR_FEMPT_Msk);
}

/**
  * @brief    Get FIFO Empty Flag
  * @rmtoll   ISR    FEMPT    FL_EPSC_IsActiveFlag_FIFOEmpty
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsActiveFlag_FIFOEmpty(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->ISR, EPSC_ISR_FEMPT_Msk) == (EPSC_ISR_FEMPT_Msk));
}

/**
  * @brief    Enable FIFO FULL interrupt
  * @note     ADC
  * @rmtoll   IER    FFIE    FL_EPSC_EnableIT_FIFOFull
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_FIFOFull(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_FFIE_Msk);
}

/**
  * @brief    Get FIFO FULL interrupt Status
  * @note     ADC
  * @rmtoll   IER    FFIE    FL_EPSC_IsEnabledIT_FIFOFull
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_FIFOFull(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_FFIE_Msk) == EPSC_IER_FFIE_Msk);
}

/**
  * @brief    Enable FIFO Half FULL interrupt
  * @note     ADC
  * @rmtoll   IER    FHFIE    FL_EPSC_EnableIT_FIFOHalfFull
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_FIFOHalfFull(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_FHFIE_Msk);
}

/**
  * @brief    Get FIFO Half FULL interrupt Status
  * @note     ADC
  * @rmtoll   IER    FHFIE    FL_EPSC_IsEnabledIT_FIFOHalfFull
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_FIFOHalfFull(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_FHFIE_Msk) == EPSC_IER_FHFIE_Msk);
}

/**
  * @brief    Enable Transfer Completed interrupt
  * @note     ADC
  * @rmtoll   IER    TCIE    FL_EPSC_EnableIT_TransferCompleted
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_TransferCompleted(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_TCIE_Msk);
}

/**
  * @brief    Get Transfer Completed  interrupt Status
  * @note     ADC
  * @rmtoll   IER    TCIE    FL_EPSC_IsEnabledIT_TransferCompleted
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_TransferCompleted(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_TCIE_Msk) == EPSC_IER_TCIE_Msk);
}

/**
  * @brief    Enable Transfer Error  interrupt
  * @note     ADC
  * @rmtoll   IER    TEIE    FL_EPSC_EnableIT_TransferError
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_TransferError(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_TEIE_Msk);
}

/**
  * @brief    Get Transfer Error t Status
  * @note     ADC
  * @rmtoll   IER    TEIE    FL_EPSC_IsEnabledIT_TransferError
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_TransferError(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_TEIE_Msk) == EPSC_IER_TEIE_Msk);
}

/**
  * @brief    Enable Timeout interrupt
  * @note     ADC
  * @rmtoll   IER    TOIE    FL_EPSC_EnableIT_Timeout
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_Timeout(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_TOIE_Msk);
}

/**
  * @brief    Get Timeout interrupt Status
  * @note     ADC
  * @rmtoll   IER    TOIE    FL_EPSC_IsEnabledIT_Timeout
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_Timeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_TOIE_Msk) == EPSC_IER_TOIE_Msk);
}

/**
  * @brief    Enable NE Rise Edge interrupt
  * @note     ADC
  * @rmtoll   IER    NERIE    FL_EPSC_EnableIT_NERiseEdge
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_NERiseEdge(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_NERIE_Msk);
}

/**
  * @brief    Get NE Rise Edge interrupt Status
  * @note     ADC
  * @rmtoll   IER    NERIE    FL_EPSC_IsEnabledIT_NERiseEdge
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_NERiseEdge(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_NERIE_Msk) == EPSC_IER_NERIE_Msk);
}

/**
  * @brief    Enable NE Fall Edge interrupt
  * @note     ADC
  * @rmtoll   IER    NEFIE    FL_EPSC_EnableIT_NEFallEdge
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_NEFallEdge(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_NEFIE_Msk);
}

/**
  * @brief    Get NE Fall Edge interrupt Status
  * @note     ADC
  * @rmtoll   IER    NEFIE    FL_EPSC_IsEnabledIT_NEFallEdge
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_NEFallEdge(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_NEFIE_Msk) == EPSC_IER_NEFIE_Msk);
}

/**
  * @brief    Enable FIFO Empty interrupt
  * @note     ADC
  * @rmtoll   IER    FEIE    FL_EPSC_EnableIT_FIFOEmpty
  * @param    EPSCx EPSC instance
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_EnableIT_FIFOEmpty(EPSC_Type *EPSCx)
{
    SET_BIT(EPSCx->IER, EPSC_IER_FEIE_Msk);
}

/**
  * @brief    Get FIFO Empty interrupt Status
  * @note     ADC
  * @rmtoll   IER    FEIE    FL_EPSC_IsEnabledIT_FIFOEmpty
  * @param    EPSCx EPSC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_EPSC_IsEnabledIT_FIFOEmpty(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->IER, EPSC_IER_FEIE_Msk) == EPSC_IER_FEIE_Msk);
}

/**
  * @brief    Write Timeout Value
  * @rmtoll   TOR    TO    FL_EPSC_WriteTimeout
  * @param    EPSCx EPSC instance
  * @param    clk
  * @retval   None
  */
__STATIC_INLINE void FL_EPSC_WriteTimeout(EPSC_Type *EPSCx, uint32_t clk)
{
    MODIFY_REG(EPSCx->TOR, (0xffffU << 0U), (clk << 0U));
}

/**
  * @brief    Get Timeoute Value
  * @rmtoll   TOR    TO    FL_EPSC_ReadTimeout
  * @param    EPSCx EPSC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_EPSC_ReadTimeout(EPSC_Type *EPSCx)
{
    return (uint32_t)(READ_BIT(EPSCx->TOR, (0xffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup EPSC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
extern FL_ErrorStatus FL_EPSC_NORSRAM_Init(EPSC_Type *EPSCx, EPSC_NORSRAM_InitTypeDef  *EPSC_InitStruct);

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_EPSC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-08-25*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
